TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
typedef struct {
       uint32_t RESERVED0[1024];
  HSADC1_ADC_LITE_RESULT_REGS_Regs  ADC_LITE_RESULT_REGS;              /* !< (@ 0x00001000) */
  union {
      __IO uint16_t ADCRESULT0_12B_M33;                /* !< ADC Result 0 Register */
      __IO uint16_t ADCRESULT0_12B_M33_ADCRESULT0_1;   /* !< ADC Result 0 Register */
  };
  union {
      __IO uint16_t ADCRESULT1_12B_M33;                /* !< ADC Result 1 Register */
      __IO uint16_t ADCRESULT1_12B_M33_ADCRESULT1_1;   /* !< ADC Result 1 Register */
  };
  union {
      __IO uint16_t ADCRESULT2_12B_M33;                /* !< ADC Result 2 Register */
      __IO uint16_t ADCRESULT2_12B_M33_ADCRESULT2_1;   /* !< ADC Result 2 Register */
  };
  union {
      __IO uint16_t ADCRESULT3_12B_M33;                /* !< ADC Result 3 Register */
      __IO uint16_t ADCRESULT3_12B_M33_ADCRESULT3_1;   /* !< ADC Result 3 Register */
  };
  union {
      __IO uint16_t ADCRESULT4_12B_M33;                /* !< ADC Result 4 Register */
      __IO uint16_t ADCRESULT4_12B_M33_ADCRESULT4_1;   /* !< ADC Result 4 Register */
  };
  union {
      __IO uint16_t ADCRESULT5_12B_M33;                /* !< ADC Result 5 Register */
      __IO uint16_t ADCRESULT5_12B_M33_ADCRESULT5_1;   /* !< ADC Result 5 Register */
  };
  union {
      __IO uint16_t ADCRESULT6_12B_M33;                /* !< ADC Result 6 Register */
      __IO uint16_t ADCRESULT6_12B_M33_ADCRESULT6_1;   /* !< ADC Result 6 Register */
  };
  union {
      __IO uint16_t ADCRESULT7_12B_M33;                /* !< ADC Result 7 Register */
      __IO uint16_t ADCRESULT7_12B_M33_ADCRESULT7_1;   /* !< ADC Result 7 Register */
  };
  union {
      __IO uint16_t ADCRESULT8_12B_M33;                /* !< ADC Result 8 Register */
      __IO uint16_t ADCRESULT8_12B_M33_ADCRESULT8_1;   /* !< ADC Result 8 Register */
  };
  union {
      __IO uint16_t ADCRESULT9_12B_M33;                /* !< ADC Result 9 Register */
      __IO uint16_t ADCRESULT9_12B_M33_ADCRESULT9_1;   /* !< ADC Result 9 Register */
  };
  union {
      __IO uint16_t ADCRESULT10_12B_M33;               /* !< ADC Result 10 Register */
      __IO uint16_t ADCRESULT10_12B_M33_ADCRESULT10_1; /* !< ADC Result 10 Register */
  };
  union {
      __IO uint16_t ADCRESULT11_12B_M33;               /* !< ADC Result 11 Register */
      __IO uint16_t ADCRESULT11_12B_M33_ADCRESULT11_1; /* !< ADC Result 11 Register */
  };
  union {
      __IO uint16_t ADCRESULT12_12B_M33;               /* !< ADC Result 12 Register */
      __IO uint16_t ADCRESULT12_12B_M33_ADCRESULT12_1; /* !< ADC Result 12 Register */
  };
  union {
      __IO uint16_t ADCRESULT13_12B_M33;               /* !< ADC Result 13 Register */
      __IO uint16_t ADCRESULT13_12B_M33_ADCRESULT13_1; /* !< ADC Result 13 Register */
  };
  union {
      __IO uint16_t ADCRESULT14_12B_M33;               /* !< ADC Result 14 Register */
      __IO uint16_t ADCRESULT14_12B_M33_ADCRESULT14_1; /* !< ADC Result 14 Register */
  };
  union {
      __IO uint16_t ADCRESULT15_12B_M33;               /* !< ADC Result 15 Register */
      __IO uint16_t ADCRESULT15_12B_M33_ADCRESULT15_1; /* !< ADC Result 15 Register */
  };
  __IO uint16_t Reserved_2[16];                    /* !< (@ 0x00001020) */
  union {
      __IO uint32_t ADCPPB1RESULT_12B_;                /* !< ADC Post Processing Block 1 Result Register */
      __IO uint32_t ADCPPB1RESULT_12B__ADCPPB1RESULT_1;/* !< ADC Post Processing Block 1 Result Register */
  };
  union {
      __IO uint32_t ADCPPB2RESULT_12B_;                /* !< ADC Post Processing Block 2 Result Register */
      __IO uint32_t ADCPPB2RESULT_12B__ADCPPB2RESULT_1;/* !< ADC Post Processing Block 2 Result Register */
  };
  union {
      __IO uint32_t ADCPPB3RESULT_12B_;                /* !< ADC Post Processing Block 3 Result Register */
      __IO uint32_t ADCPPB3RESULT_12B__ADCPPB3RESULT_1;/* !< ADC Post Processing Block 3 Result Register */
  };
  union {
      __IO uint32_t ADCPPB4RESULT_12B_;                /* !< ADC Post Processing Block 4 Result Register */
      __IO uint32_t ADCPPB4RESULT_12B__ADCPPB4RESULT_1;/* !< ADC Post Processing Block 4 Result Register */
  };
  union {
      __IO uint32_t ADCPPB1SUM_LITE_;                  /* !< ADC PPB 1 Final Sum Result Register */
      __IO uint32_t ADCPPB1SUM_LITE__ADCPPB1SUM_1;     /* !< ADC PPB 1 Final Sum Result Register */
  };
  union {
      __IO uint16_t ADCPPB1COUNT_LITE_;                /* !< ADC PPB1 Final Conversion Count Register */
      __IO uint16_t ADCPPB1COUNT_LITE__ADCPPB1COUNT_1; /* !< ADC PPB1 Final Conversion Count Register */
  };
  __IO uint16_t Reserved_3;                        /* !< (@ 0x00001056) */
  union {
      __IO uint32_t ADCPPB2SUM_LITE_;                  /* !< ADC PPB 2 Final Sum Result Register */
      __IO uint32_t ADCPPB2SUM_LITE__ADCPPB2SUM_1;     /* !< ADC PPB 2 Final Sum Result Register */
  };
  union {
      __IO uint16_t ADCPPB2COUNT_LITE_;                /* !< ADC PPB2 Final Conversion Count Register */
      __IO uint16_t ADCPPB2COUNT_LITE__ADCPPB2COUNT_1; /* !< ADC PPB2 Final Conversion Count Register */
  };
  __IO uint16_t Reserved_4;                        /* !< (@ 0x0000105E) */
  union {
      __IO uint32_t ADCPPB3SUM_LITE_;                  /* !< ADC PPB 3 Final Sum Result Register */
      __IO uint32_t ADCPPB3SUM_LITE__ADCPPB3SUM_1;     /* !< ADC PPB 3 Final Sum Result Register */
  };
  union {
      __IO uint16_t ADCPPB3COUNT_LITE_;                /* !< ADC PPB3 Final Conversion Count Register */
      __IO uint16_t ADCPPB3COUNT_LITE__ADCPPB3COUNT_1; /* !< ADC PPB3 Final Conversion Count Register */
  };
  __IO uint16_t Reserved_5;                        /* !< (@ 0x00001066) */
  union {
      __IO uint32_t ADCPPB4SUM_LITE_;                  /* !< ADC PPB 4 Final Sum Result Register */
      __IO uint32_t ADCPPB4SUM_LITE__ADCPPB4SUM_1;     /* !< ADC PPB 4 Final Sum Result Register */
  };
  union {
      __IO uint16_t ADCPPB4COUNT_LITE_;                /* !< ADC PPB4 Final Conversion Count Register */
      __IO uint16_t ADCPPB4COUNT_LITE__ADCPPB4COUNT_1; /* !< ADC PPB4 Final Conversion Count Register */
  };
  __IO uint16_t Reserved_6;                        /* !< (@ 0x0000106E) */
  __IO uint32_t ADCPPB1MAX;                        /* !< (@ 0x00001070) ADC PPB 1 Final Max Result Register */
  __IO uint16_t ADCPPB1MAXI;                       /* !< (@ 0x00001074) ADC PPB 1 Final Max Index Result Register */
  __IO uint16_t Reserved_7;                        /* !< (@ 0x00001076) */
  __IO uint32_t ADCPPB1MIN;                        /* !< (@ 0x00001078) ADC PPB 1 Final Min Result Register */
  __IO uint16_t ADCPPB1MINI;                       /* !< (@ 0x0000107C) ADC PPB 1 Final Min Index Result Register */
  __IO uint16_t Reserved_8;                        /* !< (@ 0x0000107E) */
  __IO uint32_t ADCPPB2MAX;                        /* !< (@ 0x00001080) ADC PPB 2 Final Max Result Register */
  __IO uint16_t ADCPPB2MAXI;                       /* !< (@ 0x00001084) ADC PPB 2 Final Max Index Result Register */
  __IO uint16_t Reserved_9;                        /* !< (@ 0x00001086) */
  __IO uint32_t ADCPPB2MIN;                        /* !< (@ 0x00001088) ADC PPB 2 Final Min Result Register */
  __IO uint16_t ADCPPB2MINI;                       /* !< (@ 0x0000108C) ADC PPB 2 Final Min Index Result Register */
  __IO uint16_t Reserved_10;                       /* !< (@ 0x0000108E) */
  __IO uint32_t ADCPPB3MAX;                        /* !< (@ 0x00001090) ADC PPB 3 Final Max Result Register */
  __IO uint16_t ADCPPB3MAXI;                       /* !< (@ 0x00001094) ADC PPB 3 Final Max Index Result Register */
  __IO uint16_t Reserved_11;                       /* !< (@ 0x00001096) */
  __IO uint32_t ADCPPB3MIN;                        /* !< (@ 0x00001098) ADC PPB 3 Final Min Result Register */
  __IO uint16_t ADCPPB3MINI;                       /* !< (@ 0x0000109C) ADC PPB 3 Final Min Index Result Register */
  __IO uint16_t Reserved_12;                       /* !< (@ 0x0000109E) */
  __IO uint32_t ADCPPB4MAX;                        /* !< (@ 0x000010A0) ADC PPB 4 Final Max Result Register */
  __IO uint16_t ADCPPB4MAXI;                       /* !< (@ 0x000010A4) ADC PPB 4 Final Max Index Result Register */
  __IO uint16_t Reserved_13;                       /* !< (@ 0x000010A6) */
  __IO uint32_t ADCPPB4MIN;                        /* !< (@ 0x000010A8) ADC PPB 4 Final Min Result Register */
  __IO uint16_t ADCPPB4MINI;                       /* !< (@ 0x000010AC) ADC PPB 4 Final Min Index Result Register */
  __IO uint16_t Reserved_14;                       /* !< (@ 0x000010AE) */
  __IO uint32_t Reserved_15[4];                    /* !< (@ 0x000010B0) */
  __IO uint32_t ADCSEQ1FIFORESULT;                 /* !< (@ 0x000010C0) ADC Sequence 1 FIFO Result Register */
  __IO uint32_t ADCSEQ2FIFORESULT;                 /* !< (@ 0x000010C4) ADC Sequence 2 FIFO Result Register */
  __IO uint32_t ADCSEQ3FIFORESULT;                 /* !< (@ 0x000010C8) ADC Sequence 3 FIFO Result Register */
  __IO uint32_t ADCSEQ4FIFORESULT;                 /* !< (@ 0x000010CC) ADC Sequence 4 FIFO Result Register */
  __IO uint32_t ADCSEQ1FIFOSTATUS;                 /* !< (@ 0x000010D0) ADC Sequence 1 FIFO Status */
  __IO uint32_t ADCSEQ2FIFOSTATUS;                 /* !< (@ 0x000010D4) ADC Sequence 2 FIFO Status */
  __IO uint32_t ADCSEQ3FIFOSTATUS;                 /* !< (@ 0x000010D8) ADC Sequence 3 FIFO Status */
  __IO uint32_t ADCSEQ4FIFOSTATUS;                 /* !< (@ 0x000010DC) ADC Sequence 4 FIFO Status */
  __IO uint32_t Reserved_16[968];                  /* !< (@ 0x000010E0) */
} HSADC1_ADC_LITE_RESULT_REGS_Regs;

/*@}*/ /* end of group HSADC1_ADC_LITE_RESULT_REGS */

} HSADC1_ADC_LITE_RESULT_REGS_Regs;

/*@}*/ /* end of group HSADC1_ADC_LITE_RESULT_REGS */

/** @addtogroup HSADC1_ADC_LITE_REGS
  @{
*/

