TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB1SUM_LITE_ Bits */
/* HSADC1_ADCPPB1SUM_LITE_[SUM] Bits */
#define HSADC1_ADCPPB1SUM_LITE__SUM_OFS          (0)                             /* !< SUM Offset */
#define HSADC1_ADCPPB1SUM_LITE__SUM_MASK         ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */
/* HSADC1_ADCPPB1SUM_LITE_[SIGN] Bits */
#define HSADC1_ADCPPB1SUM_LITE__SIGN_OFS         (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB1SUM_LITE__SIGN_MASK        ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB1SUM_1 Bits */
/* HSADC1_ADCPPB1SUM_1[SUM] Bits */
#define HSADC1_ADCPPB1SUM_1_SUM_OFS              (0)                             /* !< SUM Offset */
#define HSADC1_ADCPPB1SUM_1_SUM_MASK             ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */
/* HSADC1_ADCPPB1SUM_1[SIGN] Bits */
#define HSADC1_ADCPPB1SUM_1_SIGN_OFS             (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB1SUM_1_SIGN_MASK            ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

