TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB3MIN Bits */
/* HSADC1_ADCPPB3MIN[MIN] Bits */
#define HSADC1_ADCPPB3MIN_MIN_OFS                (0)                             /* !< MIN Offset */
#define HSADC1_ADCPPB3MIN_MIN_MASK               ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Min. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event, the value of PMIN is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB3RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB3RESULT
                                                                                    timing information). */
/* HSADC1_ADCPPB3MIN[SIGN] Bits */
#define HSADC1_ADCPPB3MIN_SIGN_OFS               (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3MIN_SIGN_MASK              ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB3MINI Bits */
/* HSADC1_ADCPPB3MINI[MINI] Bits */
#define HSADC1_ADCPPB3MINI_MINI_OFS              (0)                             /* !< MINI Offset */
#define HSADC1_ADCPPB3MINI_MINI_MASK             ((uint16_t)0x000003FFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Index of the Min.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB3
                                                                                    receives a sync. event, the value of
                                                                                    PMINI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the min index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB3RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB3RESULT
                                                                                    timing information). */

/* HSADC1_ADCPPB4MAX Bits */
/* HSADC1_ADCPPB4MAX[MAX] Bits */
#define HSADC1_ADCPPB4MAX_MAX_OFS                (0)                             /* !< MAX Offset */
#define HSADC1_ADCPPB4MAX_MAX_MASK               ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Max. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PMAX is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB4RESULT is available (only when
                                                                                    a count-match event occurs).  This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */
/* HSADC1_ADCPPB4MAX[SIGN] Bits */
#define HSADC1_ADCPPB4MAX_SIGN_OFS               (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4MAX_SIGN_MASK              ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB4MAXI Bits */
/* HSADC1_ADCPPB4MAXI[MAXI] Bits */
#define HSADC1_ADCPPB4MAXI_MAXI_OFS              (0)                             /* !< MAXI Offset */
#define HSADC1_ADCPPB4MAXI_MAXI_MASK             ((uint16_t)0x000003FFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Index of the Max.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event, the value of
                                                                                    PMAXI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the max index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB4RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */

/* HSADC1_ADCPPB4MIN Bits */
/* HSADC1_ADCPPB4MIN[MIN] Bits */
#define HSADC1_ADCPPB4MIN_MIN_OFS                (0)                             /* !< MIN Offset */
#define HSADC1_ADCPPB4MIN_MIN_MASK               ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Min. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PMIN is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the max loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#This result is available 1
                                                                                    SYSCLK cycle after the associated
                                                                                    ADCPPB4RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */
/* HSADC1_ADCPPB4MIN[SIGN] Bits */
#define HSADC1_ADCPPB4MIN_SIGN_OFS               (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4MIN_SIGN_MASK              ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB4MINI Bits */
/* HSADC1_ADCPPB4MINI[MINI] Bits */
#define HSADC1_ADCPPB4MINI_MINI_OFS              (0)                             /* !< MINI Offset */
#define HSADC1_ADCPPB4MINI_MINI_MASK             ((uint16_t)0x000003FFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Index of the Min.
                                                                                    When either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event, the value of
                                                                                    PMINI is loaded into this register.
                                                                                    In the case of a count-match event,
                                                                                    the min index loaded into this
                                                                                    register includes the value from the
                                                                                    most recent conversion.  #br#
                                                                                    #br#This result is available 1 SYSCLK
                                                                                    cycle after the associated
                                                                                    ADCPPB4RESULT is available (only in
                                                                                    case of a count-match event). This
                                                                                    will be 2 SYSCLK cycles after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC (refer to the ADCPPB4RESULT
                                                                                    timing information). */

/* HSADC1_ADCSEQ1FIFORESULT Bits */
/* HSADC1_ADCSEQ1FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC1_ADCSEQ1FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC1_ADCSEQ1FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 1 Result in FIFO mode */

/* HSADC1_ADCSEQ2FIFORESULT Bits */
/* HSADC1_ADCSEQ2FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC1_ADCSEQ2FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC1_ADCSEQ2FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 2 Result in FIFO mode */

/* HSADC1_ADCSEQ3FIFORESULT Bits */
/* HSADC1_ADCSEQ3FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC1_ADCSEQ3FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC1_ADCSEQ3FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 3 Result in FIFO mode */

