TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCSEQ4FIFORESULT Bits */
/* HSADC1_ADCSEQ4FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC1_ADCSEQ4FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC1_ADCSEQ4FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 4 Result in FIFO mode */

/* HSADC1_ADCSEQ1FIFOSTATUS Bits */
/* HSADC1_ADCSEQ1FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC1_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC1_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 1 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC1_ADCSEQ1FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC1_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC1_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 1 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ1FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC1_ADCSEQ2FIFOSTATUS Bits */
/* HSADC1_ADCSEQ2FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC1_ADCSEQ2FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC1_ADCSEQ2FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 2 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC1_ADCSEQ2FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC1_ADCSEQ2FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC1_ADCSEQ2FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 2 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ2FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC1_ADCSEQ3FIFOSTATUS Bits */
/* HSADC1_ADCSEQ3FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC1_ADCSEQ3FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC1_ADCSEQ3FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 3 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC1_ADCSEQ3FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC1_ADCSEQ3FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC1_ADCSEQ3FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 3 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ3FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC1_ADCSEQ4FIFOSTATUS Bits */
/* HSADC1_ADCSEQ4FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC1_ADCSEQ4FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC1_ADCSEQ4FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 4 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC1_ADCSEQ4FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC1_ADCSEQ4FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC1_ADCSEQ4FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 4 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ4FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

