TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCRESULT0_12B_M33 Bits */
/* HSADC1_ADCRESULT0_12B_M33[RESULT] Bits */
#define HSADC1_ADCRESULT0_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT0_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT0_1 Bits */
/* HSADC1_ADCRESULT0_1[RESULT] Bits */
#define HSADC1_ADCRESULT0_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT0_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT1_12B_M33 Bits */
/* HSADC1_ADCRESULT1_12B_M33[RESULT] Bits */
#define HSADC1_ADCRESULT1_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT1_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT1_1 Bits */
/* HSADC1_ADCRESULT1_1[RESULT] Bits */
#define HSADC1_ADCRESULT1_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT1_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT2_12B_M33 Bits */
/* HSADC1_ADCRESULT2_12B_M33[RESULT] Bits */
#define HSADC1_ADCRESULT2_12B_M33_RESULT_OFS     (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT2_12B_M33_RESULT_MASK    ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT2_1 Bits */
/* HSADC1_ADCRESULT2_1[RESULT] Bits */
#define HSADC1_ADCRESULT2_1_RESULT_OFS           (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT2_1_RESULT_MASK          ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

