TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCRESULT10_12B_M33 Bits */
/* HSADC1_ADCRESULT10_12B_M33[RESULT] Bits */
#define HSADC1_ADCRESULT10_12B_M33_RESULT_OFS    (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT10_12B_M33_RESULT_MASK   ((uint16_t)0x0000FFFFU)         /* !< ADC Result 10 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC10, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT10_1 Bits */
/* HSADC1_ADCRESULT10_1[RESULT] Bits */
#define HSADC1_ADCRESULT10_1_RESULT_OFS          (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT10_1_RESULT_MASK         ((uint16_t)0x0000FFFFU)         /* !< ADC Result 10 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC10, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT11_12B_M33 Bits */
/* HSADC1_ADCRESULT11_12B_M33[RESULT] Bits */
#define HSADC1_ADCRESULT11_12B_M33_RESULT_OFS    (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT11_12B_M33_RESULT_MASK   ((uint16_t)0x0000FFFFU)         /* !< ADC Result 11 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC11, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT11_1 Bits */
/* HSADC1_ADCRESULT11_1[RESULT] Bits */
#define HSADC1_ADCRESULT11_1_RESULT_OFS          (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT11_1_RESULT_MASK         ((uint16_t)0x0000FFFFU)         /* !< ADC Result 11 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC11, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT12_12B_M33 Bits */
/* HSADC1_ADCRESULT12_12B_M33[RESULT] Bits */
#define HSADC1_ADCRESULT12_12B_M33_RESULT_OFS    (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT12_12B_M33_RESULT_MASK   ((uint16_t)0x0000FFFFU)         /* !< ADC Result 12 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC12, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC1_ADCRESULT12_1 Bits */
/* HSADC1_ADCRESULT12_1[RESULT] Bits */
#define HSADC1_ADCRESULT12_1_RESULT_OFS          (0)                             /* !< RESULT Offset */
#define HSADC1_ADCRESULT12_1_RESULT_MASK         ((uint16_t)0x0000FFFFU)         /* !< ADC Result 12 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC12, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

