TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB2RESULT_1 Bits */
/* HSADC1_ADCPPB2RESULT_1[PPBRESULT] Bits */
#define HSADC1_ADCPPB2RESULT_1_PPBRESULT_OFS     (0)                             /* !< PPBRESULT Offset */
#define HSADC1_ADCPPB2RESULT_1_PPBRESULT_MASK    ((uint32_t)0x00001FFFU)         /* !< ADC Post Processing Block Result 2
                                                                                    #br# #br#The result of the
                                                                                    offset/reference subtraction post
                                                                                    conversion processing is stored in
                                                                                    this register.  #br# #br#This result
                                                                                    is available 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC.  In the case of multiple
                                                                                    PPBs associated with the same SOC,
                                                                                    the lowest numbered PPB's result will
                                                                                    be availble 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT and subsequent
                                                                                    results (in order from lowest
                                                                                    numbered PPB to highest) will each
                                                                                    become available every 2-3 SYSCLK
                                                                                    cycles (refer to the TRM for more
                                                                                    detailed timing information).  #br#
                                                                                    #br#If ADCINTFLG is polled to
                                                                                    determine when to read the PPBRESULT,
                                                                                    it may be necessary to add one or
                                                                                    more NOP instructions to ensure that
                                                                                    the updated post conversion
                                                                                    processing result has posted to the
                                                                                    register. #br# #br#NOTE: If the
                                                                                    conversion associated with this Post
                                                                                    Processing Block is a 12-bit
                                                                                    conversion, the PPBRESULT bits are
                                                                                    limited to bits 12:0. */
/* HSADC1_ADCPPB2RESULT_1[SIGN] Bits */
#define HSADC1_ADCPPB2RESULT_1_SIGN_OFS          (13)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB2RESULT_1_SIGN_MASK         ((uint32_t)0xFFFFE000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 12.
                                                                                    #br# #br#NOTE: If the conversion
                                                                                    associated with this Post Processing
                                                                                    Block is a 12-bit conversion, the
                                                                                    SIGN bits extend down to bit 12, and
                                                                                    all reflect the same value as bit 12. */

/* HSADC1_ADCPPB3RESULT_12B_ Bits */
/* HSADC1_ADCPPB3RESULT_12B_[PPBRESULT] Bits */
#define HSADC1_ADCPPB3RESULT_12B__PPBRESULT_OFS  (0)                             /* !< PPBRESULT Offset */
#define HSADC1_ADCPPB3RESULT_12B__PPBRESULT_MASK ((uint32_t)0x00001FFFU)         /* !< ADC Post Processing Block Result 3
                                                                                    #br# #br#The result of the
                                                                                    offset/reference subtraction post
                                                                                    conversion processing is stored in
                                                                                    this register.  #br# #br#This result
                                                                                    is available 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC.  In the case of multiple
                                                                                    PPBs associated with the same SOC,
                                                                                    the lowest numbered PPB's result will
                                                                                    be availble 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT and subsequent
                                                                                    results (in order from lowest
                                                                                    numbered PPB to highest) will each
                                                                                    become available every 2-3 SYSCLK
                                                                                    cycles (refer to the TRM for more
                                                                                    detailed timing information).  #br#
                                                                                    #br#If ADCINTFLG is polled to
                                                                                    determine when to read the PPBRESULT,
                                                                                    it may be necessary to add one or
                                                                                    more NOP instructions to ensure that
                                                                                    the updated post conversion
                                                                                    processing result has posted to the
                                                                                    register. #br# #br#NOTE: If the
                                                                                    conversion associated with this Post
                                                                                    Processing Block is a 12-bit
                                                                                    conversion, the PPBRESULT bits are
                                                                                    limited to bits 12:0. */
/* HSADC1_ADCPPB3RESULT_12B_[SIGN] Bits */
#define HSADC1_ADCPPB3RESULT_12B__SIGN_OFS       (13)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3RESULT_12B__SIGN_MASK      ((uint32_t)0xFFFFE000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 12.
                                                                                    #br# #br#NOTE: If the conversion
                                                                                    associated with this Post Processing
                                                                                    Block is a 12-bit conversion, the
                                                                                    SIGN bits extend down to bit 12, and
                                                                                    all reflect the same value as bit 12. */

/* HSADC1_ADCPPB3RESULT_1 Bits */
/* HSADC1_ADCPPB3RESULT_1[PPBRESULT] Bits */
#define HSADC1_ADCPPB3RESULT_1_PPBRESULT_OFS     (0)                             /* !< PPBRESULT Offset */
#define HSADC1_ADCPPB3RESULT_1_PPBRESULT_MASK    ((uint32_t)0x00001FFFU)         /* !< ADC Post Processing Block Result 3
                                                                                    #br# #br#The result of the
                                                                                    offset/reference subtraction post
                                                                                    conversion processing is stored in
                                                                                    this register.  #br# #br#This result
                                                                                    is available 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT is available,
                                                                                    unless multiple PPBs point to the
                                                                                    same SOC.  In the case of multiple
                                                                                    PPBs associated with the same SOC,
                                                                                    the lowest numbered PPB's result will
                                                                                    be availble 1 SYSCLK cycle after the
                                                                                    associated ADCRESULT and subsequent
                                                                                    results (in order from lowest
                                                                                    numbered PPB to highest) will each
                                                                                    become available every 2-3 SYSCLK
                                                                                    cycles (refer to the TRM for more
                                                                                    detailed timing information).  #br#
                                                                                    #br#If ADCINTFLG is polled to
                                                                                    determine when to read the PPBRESULT,
                                                                                    it may be necessary to add one or
                                                                                    more NOP instructions to ensure that
                                                                                    the updated post conversion
                                                                                    processing result has posted to the
                                                                                    register. #br# #br#NOTE: If the
                                                                                    conversion associated with this Post
                                                                                    Processing Block is a 12-bit
                                                                                    conversion, the PPBRESULT bits are
                                                                                    limited to bits 12:0. */
/* HSADC1_ADCPPB3RESULT_1[SIGN] Bits */
#define HSADC1_ADCPPB3RESULT_1_SIGN_OFS          (13)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3RESULT_1_SIGN_MASK         ((uint32_t)0xFFFFE000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 12.
                                                                                    #br# #br#NOTE: If the conversion
                                                                                    associated with this Post Processing
                                                                                    Block is a 12-bit conversion, the
                                                                                    SIGN bits extend down to bit 12, and
                                                                                    all reflect the same value as bit 12. */

