TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB3COUNT_LITE_ Bits */
/* HSADC1_ADCPPB3COUNT_LITE_[COUNT] Bits */
#define HSADC1_ADCPPB3COUNT_LITE__COUNT_OFS      (0)                             /* !< COUNT Offset */
#define HSADC1_ADCPPB3COUNT_LITE__COUNT_MASK     ((uint16_t)0x0000000FU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB3RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB3RESULT timing
                                                                                    information). */

/* HSADC1_ADCPPB3COUNT_1 Bits */
/* HSADC1_ADCPPB3COUNT_1[COUNT] Bits */
#define HSADC1_ADCPPB3COUNT_1_COUNT_OFS          (0)                             /* !< COUNT Offset */
#define HSADC1_ADCPPB3COUNT_1_COUNT_MASK         ((uint16_t)0x0000000FU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB3RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB3RESULT timing
                                                                                    information). */

/* HSADC1_ADCPPB4SUM_LITE_ Bits */
/* HSADC1_ADCPPB4SUM_LITE_[SUM] Bits */
#define HSADC1_ADCPPB4SUM_LITE__SUM_OFS          (0)                             /* !< SUM Offset */
#define HSADC1_ADCPPB4SUM_LITE__SUM_MASK         ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC1_ADCPPB4SUM_LITE_[SIGN] Bits */
#define HSADC1_ADCPPB4SUM_LITE__SIGN_OFS         (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4SUM_LITE__SIGN_MASK        ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB4SUM_1 Bits */
/* HSADC1_ADCPPB4SUM_1[SUM] Bits */
#define HSADC1_ADCPPB4SUM_1_SUM_OFS              (0)                             /* !< SUM Offset */
#define HSADC1_ADCPPB4SUM_1_SUM_MASK             ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC1_ADCPPB4SUM_1[SIGN] Bits */
#define HSADC1_ADCPPB4SUM_1_SIGN_OFS             (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4SUM_1_SIGN_MASK            ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB4COUNT_LITE_ Bits */
/* HSADC1_ADCPPB4COUNT_LITE_[COUNT] Bits */
#define HSADC1_ADCPPB4COUNT_LITE__COUNT_OFS      (0)                             /* !< COUNT Offset */
#define HSADC1_ADCPPB4COUNT_LITE__COUNT_MASK     ((uint16_t)0x0000000FU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB4RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB4RESULT timing
                                                                                    information). */

/* HSADC1_ADCPPB4COUNT_1 Bits */
/* HSADC1_ADCPPB4COUNT_1[COUNT] Bits */
#define HSADC1_ADCPPB4COUNT_1_COUNT_OFS          (0)                             /* !< COUNT Offset */
#define HSADC1_ADCPPB4COUNT_1_COUNT_MASK         ((uint16_t)0x0000000FU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB4RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB4RESULT timing
                                                                                    information). */

