TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCINTOVF_1 Bits */
/* HSADC1_ADCINTOVF_1[ADCINT1OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCINT1OVF_OFS        (0)                             /* !< ADCINT1OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCINT1OVF_MASK       ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC1_ADCINTOVF_1[ADCINT2OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCINT2OVF_OFS        (1)                             /* !< ADCINT2OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCINT2OVF_MASK       ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC1_ADCINTOVF_1[ADCINT3OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCINT3OVF_OFS        (2)                             /* !< ADCINT3OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCINT3OVF_MASK       ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC1_ADCINTOVF_1[ADCINT4OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCINT4OVF_OFS        (3)                             /* !< ADCINT4OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCINT4OVF_MASK       ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC1_ADCINTOVF_1[ADCDMAINT1OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCDMAINT1OVF_OFS     (16)                            /* !< ADCDMAINT1OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCDMAINT1OVF_MASK    ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */
/* HSADC1_ADCINTOVF_1[ADCDMAINT2OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCDMAINT2OVF_OFS     (17)                            /* !< ADCDMAINT2OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCDMAINT2OVF_MASK    ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */
/* HSADC1_ADCINTOVF_1[ADCDMAINT3OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCDMAINT3OVF_OFS     (18)                            /* !< ADCDMAINT3OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCDMAINT3OVF_MASK    ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */
/* HSADC1_ADCINTOVF_1[ADCDMAINT4OVF] Bits */
#define HSADC1_ADCINTOVF_1_ADCDMAINT4OVF_OFS     (19)                            /* !< ADCDMAINT4OVF Offset */
#define HSADC1_ADCINTOVF_1_ADCDMAINT4OVF_MASK    ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */

