TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_4PPB_[PPB4TRIPLO] Bits */
#define HSADC1_ADCEVTSTAT_4PPB__PPB4TRIPLO_OFS   (13)                            /* !< PPB4TRIPLO Offset */
#define HSADC1_ADCEVTSTAT_4PPB__PPB4TRIPLO_MASK  ((uint32_t)0x00002000U)         /* !< Post Processing Block 4 Trip Low
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip low event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_4PPB_[PPB4ZERO] Bits */
#define HSADC1_ADCEVTSTAT_4PPB__PPB4ZERO_OFS     (14)                            /* !< PPB4ZERO Offset */
#define HSADC1_ADCEVTSTAT_4PPB__PPB4ZERO_MASK    ((uint32_t)0x00004000U)         /* !< Post Processing Block 4 Zero
                                                                                    Crossing Flag. When set indicates the
                                                                                    ADCPPB4RESULT register has changed
                                                                                    sign. This bit is gated by EOC
                                                                                    signal. #br# #br#Note: these bits are
                                                                                    set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_4PPB_[PPB4INLIMIT] Bits */
#define HSADC1_ADCEVTSTAT_4PPB__PPB4INLIMIT_OFS  (15)                            /* !< PPB4INLIMIT Offset */
#define HSADC1_ADCEVTSTAT_4PPB__PPB4INLIMIT_MASK ((uint32_t)0x00008000U)         /* !< Post Processing Block 4 Within trip
                                                                                    limit Flag.  When set indicates a
                                                                                    digital compare within limit event
                                                                                    has occurred. This will be set when
                                                                                    the PPB result is either in between
                                                                                    or equal to the TRIPHI and TRIPLO
                                                                                    thresholds. #br# #br#Note: these bits
                                                                                    are set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */

