TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCEVTSTAT_1 Bits */
/* HSADC1_ADCEVTSTAT_1[PPB1TRIPHI] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB1TRIPHI_OFS       (0)                             /* !< PPB1TRIPHI Offset */
#define HSADC1_ADCEVTSTAT_1_PPB1TRIPHI_MASK      ((uint32_t)0x00000001U)         /* !< Post Processing Block 1 Trip High
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip high event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_1[PPB1TRIPLO] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB1TRIPLO_OFS       (1)                             /* !< PPB1TRIPLO Offset */
#define HSADC1_ADCEVTSTAT_1_PPB1TRIPLO_MASK      ((uint32_t)0x00000002U)         /* !< Post Processing Block 1 Trip Low
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip low event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_1[PPB1ZERO] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB1ZERO_OFS         (2)                             /* !< PPB1ZERO Offset */
#define HSADC1_ADCEVTSTAT_1_PPB1ZERO_MASK        ((uint32_t)0x00000004U)         /* !< Post Processing Block 1 Zero
                                                                                    Crossing Flag. When set indicates the
                                                                                    ADCPPB1RESULT register has changed
                                                                                    sign. This bit is gated by EOC
                                                                                    signal. #br# #br#Note: these bits are
                                                                                    set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_1[PPB1INLIMIT] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB1INLIMIT_OFS      (3)                             /* !< PPB1INLIMIT Offset */
#define HSADC1_ADCEVTSTAT_1_PPB1INLIMIT_MASK     ((uint32_t)0x00000008U)         /* !< Post Processing Block 1 Within trip
                                                                                    limit Flag.  When set indicates a
                                                                                    digital compare within limit event
                                                                                    has occurred. This will be set when
                                                                                    the PPB result is either in between
                                                                                    or equal to the TRIPHI and TRIPLO
                                                                                    thresholds. #br# #br#Note: these bits
                                                                                    are set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_1[PPB2TRIPHI] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB2TRIPHI_OFS       (4)                             /* !< PPB2TRIPHI Offset */
#define HSADC1_ADCEVTSTAT_1_PPB2TRIPHI_MASK      ((uint32_t)0x00000010U)         /* !< Post Processing Block 2 Trip High
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip high event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_1[PPB2TRIPLO] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB2TRIPLO_OFS       (5)                             /* !< PPB2TRIPLO Offset */
#define HSADC1_ADCEVTSTAT_1_PPB2TRIPLO_MASK      ((uint32_t)0x00000020U)         /* !< Post Processing Block 2 Trip Low
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip low event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_1[PPB2ZERO] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB2ZERO_OFS         (6)                             /* !< PPB2ZERO Offset */
#define HSADC1_ADCEVTSTAT_1_PPB2ZERO_MASK        ((uint32_t)0x00000040U)         /* !< Post Processing Block 2 Zero
                                                                                    Crossing Flag. When set indicates the
                                                                                    ADCPPB2RESULT register has changed
                                                                                    sign. This bit is gated by EOC
                                                                                    signal. #br# #br#Note: these bits are
                                                                                    set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_1[PPB2INLIMIT] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB2INLIMIT_OFS      (7)                             /* !< PPB2INLIMIT Offset */
#define HSADC1_ADCEVTSTAT_1_PPB2INLIMIT_MASK     ((uint32_t)0x00000080U)         /* !< Post Processing Block 2 Within trip
                                                                                    limit Flag.  When set indicates a
                                                                                    digital compare within limit event
                                                                                    has occurred. This will be set when
                                                                                    the PPB result is either in between
                                                                                    or equal to the TRIPHI and TRIPLO
                                                                                    thresholds. #br# #br#Note: these bits
                                                                                    are set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_1[PPB3TRIPHI] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB3TRIPHI_OFS       (8)                             /* !< PPB3TRIPHI Offset */
#define HSADC1_ADCEVTSTAT_1_PPB3TRIPHI_MASK      ((uint32_t)0x00000100U)         /* !< Post Processing Block 3 Trip High
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip high event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_1[PPB3TRIPLO] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB3TRIPLO_OFS       (9)                             /* !< PPB3TRIPLO Offset */
#define HSADC1_ADCEVTSTAT_1_PPB3TRIPLO_MASK      ((uint32_t)0x00000200U)         /* !< Post Processing Block 3 Trip Low
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip low event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC1_ADCEVTSTAT_1[PPB3ZERO] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB3ZERO_OFS         (10)                            /* !< PPB3ZERO Offset */
#define HSADC1_ADCEVTSTAT_1_PPB3ZERO_MASK        ((uint32_t)0x00000400U)         /* !< Post Processing Block 3 Zero
                                                                                    Crossing Flag. When set indicates the
                                                                                    ADCPPB3RESULT register has changed
                                                                                    sign. This bit is gated by EOC
                                                                                    signal. #br# #br#Note: these bits are
                                                                                    set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_1[PPB3INLIMIT] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB3INLIMIT_OFS      (11)                            /* !< PPB3INLIMIT Offset */
#define HSADC1_ADCEVTSTAT_1_PPB3INLIMIT_MASK     ((uint32_t)0x00000800U)         /* !< Post Processing Block 3 Within trip
                                                                                    limit Flag.  When set indicates a
                                                                                    digital compare within limit event
                                                                                    has occurred. This will be set when
                                                                                    the PPB result is either in between
                                                                                    or equal to the TRIPHI and TRIPLO
                                                                                    thresholds. #br# #br#Note: these bits
                                                                                    are set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC1_ADCEVTSTAT_1[PPB4TRIPHI] Bits */
#define HSADC1_ADCEVTSTAT_1_PPB4TRIPHI_OFS       (12)                            /* !< PPB4TRIPHI Offset */
#define HSADC1_ADCEVTSTAT_1_PPB4TRIPHI_MASK      ((uint32_t)0x00001000U)         /* !< Post Processing Block 4 Trip High
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip high event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
