TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCOSDETECT_HSADC12B_ Bits */
/* HSADC1_ADCOSDETECT_HSADC12B_[DETECTCFG] Bits */
#define HSADC1_ADCOSDETECT_HSADC12B__DETECTCFG_OFS (0)                             /* !< DETECTCFG Offset */
#define HSADC1_ADCOSDETECT_HSADC12B__DETECTCFG_MASK ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC1_ADCOSDETECT_1 Bits */
/* HSADC1_ADCOSDETECT_1[DETECTCFG] Bits */
#define HSADC1_ADCOSDETECT_1_DETECTCFG_OFS       (0)                             /* !< DETECTCFG Offset */
#define HSADC1_ADCOSDETECT_1_DETECTCFG_MASK      ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC1_ADCREV_HSADC12B_ Bits */
/* HSADC1_ADCREV_HSADC12B_[TYPE] Bits */
#define HSADC1_ADCREV_HSADC12B__TYPE_OFS         (0)                             /* !< TYPE Offset */
#define HSADC1_ADCREV_HSADC12B__TYPE_MASK        ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC1_ADCREV_HSADC12B_[REV] Bits */
#define HSADC1_ADCREV_HSADC12B__REV_OFS          (8)                             /* !< REV Offset */
#define HSADC1_ADCREV_HSADC12B__REV_MASK         ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC1_ADCREV_1 Bits */
/* HSADC1_ADCREV_1[TYPE] Bits */
#define HSADC1_ADCREV_1_TYPE_OFS                 (0)                             /* !< TYPE Offset */
#define HSADC1_ADCREV_1_TYPE_MASK                ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC1_ADCREV_1[REV] Bits */
#define HSADC1_ADCREV_1_REV_OFS                  (8)                             /* !< REV Offset */
#define HSADC1_ADCREV_1_REV_MASK                 ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC1_ADCOFFTRIM_LITE_ Bits */
/* HSADC1_ADCOFFTRIM_LITE_[OFFTRIM] Bits */
#define HSADC1_ADCOFFTRIM_LITE__OFFTRIM_OFS      (0)                             /* !< OFFTRIM Offset */
#define HSADC1_ADCOFFTRIM_LITE__OFFTRIM_MASK     ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC1_ADCOFFTRIM_1 Bits */
/* HSADC1_ADCOFFTRIM_1[OFFTRIM] Bits */
#define HSADC1_ADCOFFTRIM_1_OFFTRIM_OFS          (0)                             /* !< OFFTRIM Offset */
#define HSADC1_ADCOFFTRIM_1_OFFTRIM_MASK         ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC1_ADCCONFIG_12B_ Bits */
/* HSADC1_ADCCONFIG_12B_[CONFIG] Bits */
#define HSADC1_ADCCONFIG_12B__CONFIG_OFS         (0)                             /* !< CONFIG Offset */
#define HSADC1_ADCCONFIG_12B__CONFIG_MASK        ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

/* HSADC1_ADCCONFIG_1 Bits */
/* HSADC1_ADCCONFIG_1[CONFIG] Bits */
#define HSADC1_ADCCONFIG_1_CONFIG_OFS            (0)                             /* !< CONFIG Offset */
#define HSADC1_ADCCONFIG_1_CONFIG_MASK           ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

/* HSADC1_ADCPPB1CONFIG_M33_ Bits */
/* HSADC1_ADCPPB1CONFIG_M33_[CBCEN] Bits */
#define HSADC1_ADCPPB1CONFIG_M33__CBCEN_OFS      (5)                             /* !< CBCEN Offset */
#define HSADC1_ADCPPB1CONFIG_M33__CBCEN_MASK     ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC1_ADCPPB1CONFIG_M33_[TWOSCOMPEN] Bits */
#define HSADC1_ADCPPB1CONFIG_M33__TWOSCOMPEN_OFS (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC1_ADCPPB1CONFIG_M33__TWOSCOMPEN_MASK ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 1 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB1RESULT register. #br# #br#  0
                                                                                    ADCPPB1RESULT = ADCRESULTx -
                                                                                    ADCPPB1OFFREF #br#  1  ADCPPB1RESULT
                                                                                    = ADCPPB1OFFREF - ADCRESULTx */

/* HSADC1_ADCPPB1CONFIG_1 Bits */
/* HSADC1_ADCPPB1CONFIG_1[CBCEN] Bits */
#define HSADC1_ADCPPB1CONFIG_1_CBCEN_OFS         (5)                             /* !< CBCEN Offset */
#define HSADC1_ADCPPB1CONFIG_1_CBCEN_MASK        ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC1_ADCPPB1CONFIG_1[TWOSCOMPEN] Bits */
#define HSADC1_ADCPPB1CONFIG_1_TWOSCOMPEN_OFS    (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC1_ADCPPB1CONFIG_1_TWOSCOMPEN_MASK   ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 1 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB1RESULT register. #br# #br#  0
                                                                                    ADCPPB1RESULT = ADCRESULTx -
                                                                                    ADCPPB1OFFREF #br#  1  ADCPPB1RESULT
                                                                                    = ADCPPB1OFFREF - ADCRESULTx */

/* HSADC1_ADCPPB1OFFCAL_LITE_ Bits */
/* HSADC1_ADCPPB1OFFCAL_LITE_[OFFCAL] Bits */
#define HSADC1_ADCPPB1OFFCAL_LITE__OFFCAL_OFS    (0)                             /* !< OFFCAL Offset */
#define HSADC1_ADCPPB1OFFCAL_LITE__OFFCAL_MASK   ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 1 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

/* HSADC1_ADCPPB1OFFCAL_1 Bits */
/* HSADC1_ADCPPB1OFFCAL_1[OFFCAL] Bits */
#define HSADC1_ADCPPB1OFFCAL_1_OFFCAL_OFS        (0)                             /* !< OFFCAL Offset */
#define HSADC1_ADCPPB1OFFCAL_1_OFFCAL_MASK       ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 1 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

