TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB4CONFIG_M33_ Bits */
/* HSADC1_ADCPPB4CONFIG_M33_[CBCEN] Bits */
#define HSADC1_ADCPPB4CONFIG_M33__CBCEN_OFS      (5)                             /* !< CBCEN Offset */
#define HSADC1_ADCPPB4CONFIG_M33__CBCEN_MASK     ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC1_ADCPPB4CONFIG_M33_[TWOSCOMPEN] Bits */
#define HSADC1_ADCPPB4CONFIG_M33__TWOSCOMPEN_OFS (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC1_ADCPPB4CONFIG_M33__TWOSCOMPEN_MASK ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 4 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB4RESULT register. #br# #br#  0
                                                                                    ADCPPB4RESULT = ADCRESULTx -
                                                                                    ADCPPB4OFFREF #br#  1  ADCPPB4RESULT
                                                                                    = ADCPPB4OFFREF - ADCRESULTx */

/* HSADC1_ADCPPB4CONFIG_1 Bits */
/* HSADC1_ADCPPB4CONFIG_1[CBCEN] Bits */
#define HSADC1_ADCPPB4CONFIG_1_CBCEN_OFS         (5)                             /* !< CBCEN Offset */
#define HSADC1_ADCPPB4CONFIG_1_CBCEN_MASK        ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC1_ADCPPB4CONFIG_1[TWOSCOMPEN] Bits */
#define HSADC1_ADCPPB4CONFIG_1_TWOSCOMPEN_OFS    (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC1_ADCPPB4CONFIG_1_TWOSCOMPEN_MASK   ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 4 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB4RESULT register. #br# #br#  0
                                                                                    ADCPPB4RESULT = ADCRESULTx -
                                                                                    ADCPPB4OFFREF #br#  1  ADCPPB4RESULT
                                                                                    = ADCPPB4OFFREF - ADCRESULTx */

/* HSADC1_ADCPPB4OFFCAL_LITE_ Bits */
/* HSADC1_ADCPPB4OFFCAL_LITE_[OFFCAL] Bits */
#define HSADC1_ADCPPB4OFFCAL_LITE__OFFCAL_OFS    (0)                             /* !< OFFCAL Offset */
#define HSADC1_ADCPPB4OFFCAL_LITE__OFFCAL_MASK   ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

/* HSADC1_ADCPPB4OFFCAL_1 Bits */
/* HSADC1_ADCPPB4OFFCAL_1[OFFCAL] Bits */
#define HSADC1_ADCPPB4OFFCAL_1_OFFCAL_OFS        (0)                             /* !< OFFCAL Offset */
#define HSADC1_ADCPPB4OFFCAL_1_OFFCAL_MASK       ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

/* HSADC1_ADCPPB4OFFREF_LITE_ Bits */
/* HSADC1_ADCPPB4OFFREF_LITE_[OFFREF] Bits */
#define HSADC1_ADCPPB4OFFREF_LITE__OFFREF_OFS    (0)                             /* !< OFFREF Offset */
#define HSADC1_ADCPPB4OFFREF_LITE__OFFREF_MASK   ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB4RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC1_ADCPPB4OFFREF_1 Bits */
/* HSADC1_ADCPPB4OFFREF_1[OFFREF] Bits */
#define HSADC1_ADCPPB4OFFREF_1_OFFREF_OFS        (0)                             /* !< OFFREF Offset */
#define HSADC1_ADCPPB4OFFREF_1_OFFREF_MASK       ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 4 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB4RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC1_ADCPPB4TRIPHI_LITE_ Bits */
/* HSADC1_ADCPPB4TRIPHI_LITE_[LIMITHI] Bits */
#define HSADC1_ADCPPB4TRIPHI_LITE__LIMITHI_OFS   (0)                             /* !< LIMITHI Offset */
#define HSADC1_ADCPPB4TRIPHI_LITE__LIMITHI_MASK  ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

