TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB2PMIN Bits */
/* HSADC1_ADCPPB2PMIN[PMIN] Bits */
#define HSADC1_ADCPPB2PMIN_PMIN_OFS              (0)                             /* !< PMIN Offset */
#define HSADC1_ADCPPB2PMIN_PMIN_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Partial Min.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB2RESULT the result replaces
                                                                                    this register if it is smaller.
                                                                                    #br# #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB2 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB2RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB2RESULT timing information). */
/* HSADC1_ADCPPB2PMIN[SIGN] Bits */
#define HSADC1_ADCPPB2PMIN_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB2PMIN_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB2TRIPLO2 Bits */
/* HSADC1_ADCPPB2TRIPLO2[LIMITLO] Bits */
#define HSADC1_ADCPPB2TRIPLO2_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC1_ADCPPB2TRIPLO2_LIMITLO_MASK       ((uint32_t)0x00FFFFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO2[23:17] will be ignored in 16
                                                                                    bit mode #br#- TRIPLO2[23:13] will be
                                                                                    ignored in 12 bit mode */

/* HSADC1_ADCPPB3LIMIT_LITE_ Bits */
/* HSADC1_ADCPPB3LIMIT_LITE_[LIMIT] Bits */
#define HSADC1_ADCPPB3LIMIT_LITE__LIMIT_OFS      (0)                             /* !< LIMIT Offset */
#define HSADC1_ADCPPB3LIMIT_LITE__LIMIT_MASK     ((uint32_t)0x00000003U)         /* !< Post Processing Block 3
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC1_ADCPPB3LIMIT_1 Bits */
/* HSADC1_ADCPPB3LIMIT_1[LIMIT] Bits */
#define HSADC1_ADCPPB3LIMIT_1_LIMIT_OFS          (0)                             /* !< LIMIT Offset */
#define HSADC1_ADCPPB3LIMIT_1_LIMIT_MASK         ((uint32_t)0x00000003U)         /* !< Post Processing Block 3
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC1_ADCPPB3PCOUNT_LITE_ Bits */
/* HSADC1_ADCPPB3PCOUNT_LITE_[PCOUNT] Bits */
#define HSADC1_ADCPPB3PCOUNT_LITE__PCOUNT_OFS    (0)                             /* !< PCOUNT Offset */
#define HSADC1_ADCPPB3PCOUNT_LITE__PCOUNT_MASK   ((uint32_t)0x00000007U)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB3PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */

/* HSADC1_ADCPPB3PCOUNT_1 Bits */
/* HSADC1_ADCPPB3PCOUNT_1[PCOUNT] Bits */
#define HSADC1_ADCPPB3PCOUNT_1_PCOUNT_OFS        (0)                             /* !< PCOUNT Offset */
#define HSADC1_ADCPPB3PCOUNT_1_PCOUNT_MASK       ((uint32_t)0x00000007U)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB3PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */

