TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB4CONFIG2_1 Bits */
/* HSADC1_ADCPPB4CONFIG2_1[SHIFT] Bits */
#define HSADC1_ADCPPB4CONFIG2_1_SHIFT_OFS        (0)                             /* !< SHIFT Offset */
#define HSADC1_ADCPPB4CONFIG2_1_SHIFT_MASK       ((uint32_t)0x00000007U)         /* !< Post Processing Block 4 right
                                                                                    shift.  Defines the number of bits to
                                                                                    right shift PSUM before loading into
                                                                                    the final SUM.   #br# #br#0 : no
                                                                                    right shift #br#1 : SUM = PSUM >> 1
                                                                                    #br#2 : SUM = PSUM >> 2 #br#... #br#7
                                                                                    : SUM = PSUM >> 7 */
/* HSADC1_ADCPPB4CONFIG2_1[SYNCINSEL] Bits */
#define HSADC1_ADCPPB4CONFIG2_1_SYNCINSEL_OFS    (4)                             /* !< SYNCINSEL Offset */
#define HSADC1_ADCPPB4CONFIG2_1_SYNCINSEL_MASK   ((uint32_t)0x00000070U)         /* !< PPB 4 sync. input select.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.   #br#Refer to SOC
                                                                                    spec for details */
/* HSADC1_ADCPPB4CONFIG2_1[SWSYNC] Bits */
#define HSADC1_ADCPPB4CONFIG2_1_SWSYNC_OFS       (11)                            /* !< SWSYNC Offset */
#define HSADC1_ADCPPB4CONFIG2_1_SWSYNC_MASK      ((uint32_t)0x00000800U)         /* !< PPB 4 software force sync.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.  #br# #br#Note: In
                                                                                    the case where the software force
                                                                                    occurs at the same time that a new
                                                                                    sample is added to the PSUM and the
                                                                                    PSUM is being used for a high or low
                                                                                    limit compare, then the comparison
                                                                                    will not occur. */
/* HSADC1_ADCPPB4CONFIG2_1[OSINTSEL] Bits */
#define HSADC1_ADCPPB4CONFIG2_1_OSINTSEL_OFS     (12)                            /* !< OSINTSEL Offset */
#define HSADC1_ADCPPB4CONFIG2_1_OSINTSEL_MASK    ((uint32_t)0x00001000U)         /* !< Post Processing Block 4 Interrupt
                                                                                    Source Select.  #br# #br#OSINT4 can
                                                                                    be used to trigger an ADC interrupt
                                                                                    (ADCINT1 through ADCINT4) via
                                                                                    selection in the ADCINT1N2 or
                                                                                    ADCINT3N4.  This selection determines
                                                                                    if a sync. event can trigger OSINT4
                                                                                    in addition to a PCOUNT = LIMIT
                                                                                    event.     #br#   #br#0 = OSINT4 will
                                                                                    be generated from PCOUNT = LIMIT only
                                                                                    #br#1 = OSTIN4 will be generated form
                                                                                    PCOUNT = LIMIT or a sync. event.
                                                                                    #br# #br#Note: If a SYNC event would
                                                                                    cause an OSINT one cycle after OSINT
                                                                                    would have been cause by PCOUNT =
                                                                                    LIMIT match, then the second OSINT is
                                                                                    ignored. */
/* HSADC1_ADCPPB4CONFIG2_1[COMPSEL] Bits */
#define HSADC1_ADCPPB4CONFIG2_1_COMPSEL_OFS      (15)                            /* !< COMPSEL Offset */
#define HSADC1_ADCPPB4CONFIG2_1_COMPSEL_MASK     ((uint32_t)0x00008000U)         /* !< Post Processing Block 4 Compare
                                                                                    Source Select.  This field determines
                                                                                    whether ADCPPB4RESULT or ADCPPB4SUM
                                                                                    is used for the threshold compare.
                                                                                    #br# #br#0 = ADCPPB4RESULT is used
                                                                                    for compare logic #br#1 = ADCPPB4SUM
                                                                                    is used for compare logic */

/* HSADC1_ADCPPB4PSUM_LITE_ Bits */
/* HSADC1_ADCPPB4PSUM_LITE_[PSUM] Bits */
#define HSADC1_ADCPPB4PSUM_LITE__PSUM_OFS        (0)                             /* !< PSUM Offset */
#define HSADC1_ADCPPB4PSUM_LITE__PSUM_MASK       ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB4RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC1_ADCPPB4PSUM_LITE_[SIGN] Bits */
#define HSADC1_ADCPPB4PSUM_LITE__SIGN_OFS        (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4PSUM_LITE__SIGN_MASK       ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB4PSUM_1 Bits */
/* HSADC1_ADCPPB4PSUM_1[PSUM] Bits */
#define HSADC1_ADCPPB4PSUM_1_PSUM_OFS            (0)                             /* !< PSUM Offset */
#define HSADC1_ADCPPB4PSUM_1_PSUM_MASK           ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB4RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC1_ADCPPB4PSUM_1[SIGN] Bits */
#define HSADC1_ADCPPB4PSUM_1_SIGN_OFS            (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4PSUM_1_SIGN_MASK           ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB4PMAX Bits */
/* HSADC1_ADCPPB4PMAX[PMAX] Bits */
#define HSADC1_ADCPPB4PMAX_PMAX_OFS              (0)                             /* !< PMAX Offset */
#define HSADC1_ADCPPB4PMAX_PMAX_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Max.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result replaces
                                                                                    this register if it is larger.   #br#
                                                                                    #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB4 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC1_ADCPPB4PMAX[SIGN] Bits */
#define HSADC1_ADCPPB4PMAX_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4PMAX_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB4PMIN Bits */
/* HSADC1_ADCPPB4PMIN[PMIN] Bits */
#define HSADC1_ADCPPB4PMIN_PMIN_OFS              (0)                             /* !< PMIN Offset */
#define HSADC1_ADCPPB4PMIN_PMIN_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Min.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result replaces
                                                                                    this register if it is smaller.
                                                                                    #br# #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB4 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC1_ADCPPB4PMIN[SIGN] Bits */
#define HSADC1_ADCPPB4PMIN_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB4PMIN_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB4TRIPLO2 Bits */
/* HSADC1_ADCPPB4TRIPLO2[LIMITLO] Bits */
#define HSADC1_ADCPPB4TRIPLO2_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC1_ADCPPB4TRIPLO2_LIMITLO_MASK       ((uint32_t)0x00FFFFFFU)         /* !< ADC Post Processing Block 4 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB4TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO2[23:17] will be ignored in 16
                                                                                    bit mode #br#- TRIPLO2[23:13] will be
                                                                                    ignored in 12 bit mode */

/* HSADC1_DTB_HSADC12B_ Bits */
/* HSADC1_DTB_HSADC12B_[DTB_OUT] Bits */
#define HSADC1_DTB_HSADC12B__DTB_OUT_OFS         (0)                             /* !< DTB_OUT Offset */
#define HSADC1_DTB_HSADC12B__DTB_OUT_MASK        ((uint32_t)0x0000FFFFU)         /* !< Digital Test Bus from HSADC12b */

