TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCSEQ4CONFIG Bits */
/* HSADC1_ADCSEQ4CONFIG[ACQPS] Bits */
#define HSADC1_ADCSEQ4CONFIG_ACQPS_OFS           (0)                             /* !< ACQPS Offset */
#define HSADC1_ADCSEQ4CONFIG_ACQPS_MASK          ((uint32_t)0x000000FFU)         /* !< SOC4 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC1_ADCSEQ4CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC1_ADCSEQ4CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC1_ADCSEQ4CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC4 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC1_ADCSEQ4CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC1_ADCSEQ4CONFIG_SAMPCAPRESETSEL_OFS (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC1_ADCSEQ4CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC4 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC1_ADCSEQ4CONFIG[SEQSTART] Bits */
#define HSADC1_ADCSEQ4CONFIG_SEQSTART_OFS        (15)                            /* !< SEQSTART Offset */
#define HSADC1_ADCSEQ4CONFIG_SEQSTART_MASK       ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ4 */
/* HSADC1_ADCSEQ4CONFIG[TRIGSEL] Bits */
#define HSADC1_ADCSEQ4CONFIG_TRIGSEL_OFS         (20)                            /* !< TRIGSEL Offset */
#define HSADC1_ADCSEQ4CONFIG_TRIGSEL_MASK        ((uint32_t)0x00700000U)         /* !< SOC4 Trigger Source Select. Along
                                                                                    with the SOC4 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC4 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC1_ADCSEQ4CONFIG[SEQSWFRC] Bits */
#define HSADC1_ADCSEQ4CONFIG_SEQSWFRC_OFS        (30)                            /* !< SEQSWFRC Offset */
#define HSADC1_ADCSEQ4CONFIG_SEQSWFRC_MASK       ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 4 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC1_ADCSEQ4CONFIG[SEQENABLE] Bits */
#define HSADC1_ADCSEQ4CONFIG_SEQENABLE_OFS       (31)                            /* !< SEQENABLE Offset */
#define HSADC1_ADCSEQ4CONFIG_SEQENABLE_MASK      ((uint32_t)0x80000000U)         /* !< SEQ4Enable #br#Indicates whether
                                                                                    the Sequence4 is enabled or not */

/* HSADC1_PWREN Bits */
/* HSADC1_PWREN[ENABLE] Bits */
#define HSADC1_PWREN_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define HSADC1_PWREN_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< Enable the power */
#define HSADC1_PWREN_ENABLE_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable Power */
#define HSADC1_PWREN_ENABLE_ENABLE               ((uint32_t)0x00000001U)         /* !< Enable Power */
/* HSADC1_PWREN[KEY] Bits */
#define HSADC1_PWREN_KEY_OFS                     (24)                            /* !< KEY Offset */
#define HSADC1_PWREN_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define HSADC1_PWREN_KEY_UNLOCK_W                ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* HSADC1_RSTCTL Bits */
/* HSADC1_RSTCTL[RESETSTKYCLR] Bits */
#define HSADC1_RSTCTL_RESETSTKYCLR_OFS           (1)                             /* !< RESETSTKYCLR Offset */
#define HSADC1_RSTCTL_RESETSTKYCLR_MASK          ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define HSADC1_RSTCTL_RESETSTKYCLR_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define HSADC1_RSTCTL_RESETSTKYCLR_CLR           ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* HSADC1_RSTCTL[RESETASSERT] Bits */
#define HSADC1_RSTCTL_RESETASSERT_OFS            (0)                             /* !< RESETASSERT Offset */
#define HSADC1_RSTCTL_RESETASSERT_MASK           ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define HSADC1_RSTCTL_RESETASSERT_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define HSADC1_RSTCTL_RESETASSERT_ASSERT         ((uint32_t)0x00000001U)         /* !< Assert reset */
/* HSADC1_RSTCTL[KEY] Bits */
#define HSADC1_RSTCTL_KEY_OFS                    (24)                            /* !< KEY Offset */
#define HSADC1_RSTCTL_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define HSADC1_RSTCTL_KEY_UNLOCK_W               ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* HSADC1_STAT Bits */
/* HSADC1_STAT[RESETSTKYCLR] Bits */
#define HSADC1_STAT_RESETSTKYCLR_OFS             (16)                            /* !< RESETSTKYCLR Offset */
#define HSADC1_STAT_RESETSTKYCLR_MASK            ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define HSADC1_STAT_RESETSTKYCLR_NORES           ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define HSADC1_STAT_RESETSTKYCLR_RESET           ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* HSADC1_ADCCTL1_LITE_ Bits */
/* HSADC1_ADCCTL1_LITE_[INTPULSEPOS] Bits */
#define HSADC1_ADCCTL1_LITE__INTPULSEPOS_OFS     (2)                             /* !< INTPULSEPOS Offset */
#define HSADC1_ADCCTL1_LITE__INTPULSEPOS_MASK    ((uint32_t)0x00000004U)         /* !< ADC Interrupt Pulse Position. #br#
                                                                                    #br#  0  Interrupt  pulse generation
                                                                                    occurs when ADC begins conversion (at
                                                                                    the end of the acquisition window)
                                                                                    plus a number of SYSCLK cycles as
                                                                                    specified in the ADCINTCYCLE.OFFSET
                                                                                    register. #br#  1  Interrupt pulse
                                                                                    generation occurs at the end of the
                                                                                    conversion, 1 cycle prior to the ADC
                                                                                    result latching into its result
                                                                                    register */
/* HSADC1_ADCCTL1_LITE_[ADCPWDNZ] Bits */
#define HSADC1_ADCCTL1_LITE__ADCPWDNZ_OFS        (7)                             /* !< ADCPWDNZ Offset */
#define HSADC1_ADCCTL1_LITE__ADCPWDNZ_MASK       ((uint32_t)0x00000080U)         /* !< ADC Power Down (active low). This
                                                                                    bit controls the power up and power
                                                                                    down of all the analog circuitry
                                                                                    inside the analog core. #br# #br#  0
                                                                                    All analog circuitry inside the core
                                                                                    is powered down #br#  1  All analog
                                                                                    circuitry inside the core is powered
                                                                                    up */
/* HSADC1_ADCCTL1_LITE_[ADCBSYCHN] Bits */
#define HSADC1_ADCCTL1_LITE__ADCBSYCHN_OFS       (8)                             /* !< ADCBSYCHN Offset */
#define HSADC1_ADCCTL1_LITE__ADCBSYCHN_MASK      ((uint32_t)0x00000F00U)         /* !< ADC Busy Channel. Set when an ADC
                                                                                    Start of Conversion (SOC) is
                                                                                    generated. #br#When ADCBSY=0: holds
                                                                                    the value of the last converted SOC
                                                                                    #br#When ADCBSY=1: reflects the SOC
                                                                                    currently being processed #br#  0h
                                                                                    SOC0 is currently processing or was
                                                                                    last SOC converted #br#  1h  SOC1 is
                                                                                    currently processing or was last SOC
                                                                                    converted #br#  2h  SOC2 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  3h  SOC3 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  4h  SOC4 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  5h  SOC5 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  6h  SOC6 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  7h  SOC7 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  8h  SOC8 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  9h  SOC9 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ah  SOC10 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Bh  SOC11 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ch  SOC12 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Dh  SOC13 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Eh  SOC14 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Fh  SOC15 is currently
                                                                                    processing or was last SOC converted */
/* HSADC1_ADCCTL1_LITE_[ADCBSY] Bits */
#define HSADC1_ADCCTL1_LITE__ADCBSY_OFS          (13)                            /* !< ADCBSY Offset */
#define HSADC1_ADCCTL1_LITE__ADCBSY_MASK         ((uint32_t)0x00002000U)         /* !< ADC Busy. Set when ADC SOC is
                                                                                    generated, cleared by hardware four
                                                                                    ADC clocks after negative edge of S/H
                                                                                    pulse. Used by the ADC state machine
                                                                                    to determine if ADC is available to
                                                                                    sample. #br# #br#  0  ADC is
                                                                                    available to sample next channel #br#
                                                                                    1  ADC is busy and cannot sample
                                                                                    another channel */

