TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCCTL1_1 Bits */
/* HSADC1_ADCCTL1_1[INTPULSEPOS] Bits */
#define HSADC1_ADCCTL1_1_INTPULSEPOS_OFS         (2)                             /* !< INTPULSEPOS Offset */
#define HSADC1_ADCCTL1_1_INTPULSEPOS_MASK        ((uint32_t)0x00000004U)         /* !< ADC Interrupt Pulse Position. #br#
                                                                                    #br#  0  Interrupt  pulse generation
                                                                                    occurs when ADC begins conversion (at
                                                                                    the end of the acquisition window)
                                                                                    plus a number of SYSCLK cycles as
                                                                                    specified in the ADCINTCYCLE.OFFSET
                                                                                    register. #br#  1  Interrupt pulse
                                                                                    generation occurs at the end of the
                                                                                    conversion, 1 cycle prior to the ADC
                                                                                    result latching into its result
                                                                                    register */
/* HSADC1_ADCCTL1_1[ADCPWDNZ] Bits */
#define HSADC1_ADCCTL1_1_ADCPWDNZ_OFS            (7)                             /* !< ADCPWDNZ Offset */
#define HSADC1_ADCCTL1_1_ADCPWDNZ_MASK           ((uint32_t)0x00000080U)         /* !< ADC Power Down (active low). This
                                                                                    bit controls the power up and power
                                                                                    down of all the analog circuitry
                                                                                    inside the analog core. #br# #br#  0
                                                                                    All analog circuitry inside the core
                                                                                    is powered down #br#  1  All analog
                                                                                    circuitry inside the core is powered
                                                                                    up */
/* HSADC1_ADCCTL1_1[ADCBSYCHN] Bits */
#define HSADC1_ADCCTL1_1_ADCBSYCHN_OFS           (8)                             /* !< ADCBSYCHN Offset */
#define HSADC1_ADCCTL1_1_ADCBSYCHN_MASK          ((uint32_t)0x00000F00U)         /* !< ADC Busy Channel. Set when an ADC
                                                                                    Start of Conversion (SOC) is
                                                                                    generated. #br#When ADCBSY=0: holds
                                                                                    the value of the last converted SOC
                                                                                    #br#When ADCBSY=1: reflects the SOC
                                                                                    currently being processed #br#  0h
                                                                                    SOC0 is currently processing or was
                                                                                    last SOC converted #br#  1h  SOC1 is
                                                                                    currently processing or was last SOC
                                                                                    converted #br#  2h  SOC2 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  3h  SOC3 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  4h  SOC4 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  5h  SOC5 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  6h  SOC6 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  7h  SOC7 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  8h  SOC8 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  9h  SOC9 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ah  SOC10 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Bh  SOC11 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Ch  SOC12 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Dh  SOC13 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Eh  SOC14 is currently
                                                                                    processing or was last SOC converted
                                                                                    #br#  Fh  SOC15 is currently
                                                                                    processing or was last SOC converted */
/* HSADC1_ADCCTL1_1[ADCBSY] Bits */
#define HSADC1_ADCCTL1_1_ADCBSY_OFS              (13)                            /* !< ADCBSY Offset */
#define HSADC1_ADCCTL1_1_ADCBSY_MASK             ((uint32_t)0x00002000U)         /* !< ADC Busy. Set when ADC SOC is
                                                                                    generated, cleared by hardware four
                                                                                    ADC clocks after negative edge of S/H
                                                                                    pulse. Used by the ADC state machine
                                                                                    to determine if ADC is available to
                                                                                    sample. #br# #br#  0  ADC is
                                                                                    available to sample next channel #br#
                                                                                    1  ADC is busy and cannot sample
                                                                                    another channel */

/* HSADC1_ADCCTL2_LITE_ Bits */
/* HSADC1_ADCCTL2_LITE_[PRESCALE] Bits */
#define HSADC1_ADCCTL2_LITE__PRESCALE_OFS        (0)                             /* !< PRESCALE Offset */
#define HSADC1_ADCCTL2_LITE__PRESCALE_MASK       ((uint32_t)0x0000000FU)         /* !< ADC Clock Prescaler. #br#  0000
                                                                                    ADCCLK = Input Clock / 1.0 #br#  0001
                                                                                    ADCCLK = Input Clock / 1.5 #br#
                                                                                    0010  ADCCLK = Input Clock / 2.0 #br#
                                                                                    0011  ADCCLK = Input Clock / 2.5
                                                                                    #br#  0100  ADCCLK = Input Clock /
                                                                                    3.0 #br#  0101  ADCCLK = Input Clock
                                                                                    / 3.5 #br#  0110  ADCCLK = Input
                                                                                    Clock / 4.0 #br#  0111  ADCCLK =
                                                                                    Input Clock / 4.5 #br#  1000  ADCCLK
                                                                                    = Input Clock / 5.0 #br#  1001
                                                                                    ADCCLK = Input Clock / 5.5 #br#  1010
                                                                                    ADCCLK = Input Clock / 6.0 #br#
                                                                                    1011  ADCCLK = Input Clock / 6.5 #br#
                                                                                    1100  ADCCLK = Input Clock / 7.0
                                                                                    #br#  1101  ADCCLK = Input Clock /
                                                                                    7.5 #br#  1110  ADCCLK = Input Clock
                                                                                    / 8.0 #br#  1111  ADCCLK = Input
                                                                                    Clock / 8.5 */
/* HSADC1_ADCCTL2_LITE_[RESOLUTION] Bits */
#define HSADC1_ADCCTL2_LITE__RESOLUTION_OFS      (6)                             /* !< RESOLUTION Offset */
#define HSADC1_ADCCTL2_LITE__RESOLUTION_MASK     ((uint32_t)0x00000040U)         /* !< SOC Conversion Resolution. Selects
                                                                                    the resolution of the converter. Use
                                                                                    the AdcSetMode function to change the
                                                                                    resolution. #br#  0  12-bit
                                                                                    resolution #br#  1  16-bit resolution */
/* HSADC1_ADCCTL2_LITE_[SIGNALMODE] Bits */
#define HSADC1_ADCCTL2_LITE__SIGNALMODE_OFS      (7)                             /* !< SIGNALMODE Offset */
#define HSADC1_ADCCTL2_LITE__SIGNALMODE_MASK     ((uint32_t)0x00000080U)         /* !< SOC Signaling Mode. Selects the
                                                                                    input mode of the converter. Use the
                                                                                    AdcSetMode function to change the
                                                                                    signal mode. #br#  0  Single-ended
                                                                                    #br#  1  Differential */
/* HSADC1_ADCCTL2_LITE_[DEBUGMODE] Bits */
#define HSADC1_ADCCTL2_LITE__DEBUGMODE_OFS       (8)                             /* !< DEBUGMODE Offset */
#define HSADC1_ADCCTL2_LITE__DEBUGMODE_MASK      ((uint32_t)0x00000100U)         /* !< ADC Clocking Mode. Selects the
                                                                                    number of ADCCLK pulses to be
                                                                                    generated to the converter. #br#  0
                                                                                    Default mode - Generate only
                                                                                    sufficient number of clocks based on
                                                                                    Resolution and Sample Cap reset. #br#
                                                                                    1  Debug mode - Generate 2
                                                                                    additional ADCCLK pulses for every
                                                                                    conversion. */

/* HSADC1_ADCCTL2_1 Bits */
/* HSADC1_ADCCTL2_1[PRESCALE] Bits */
#define HSADC1_ADCCTL2_1_PRESCALE_OFS            (0)                             /* !< PRESCALE Offset */
#define HSADC1_ADCCTL2_1_PRESCALE_MASK           ((uint32_t)0x0000000FU)         /* !< ADC Clock Prescaler. #br#  0000
                                                                                    ADCCLK = Input Clock / 1.0 #br#  0001
                                                                                    ADCCLK = Input Clock / 1.5 #br#
                                                                                    0010  ADCCLK = Input Clock / 2.0 #br#
                                                                                    0011  ADCCLK = Input Clock / 2.5
                                                                                    #br#  0100  ADCCLK = Input Clock /
                                                                                    3.0 #br#  0101  ADCCLK = Input Clock
                                                                                    / 3.5 #br#  0110  ADCCLK = Input
                                                                                    Clock / 4.0 #br#  0111  ADCCLK =
                                                                                    Input Clock / 4.5 #br#  1000  ADCCLK
                                                                                    = Input Clock / 5.0 #br#  1001
                                                                                    ADCCLK = Input Clock / 5.5 #br#  1010
                                                                                    ADCCLK = Input Clock / 6.0 #br#
                                                                                    1011  ADCCLK = Input Clock / 6.5 #br#
                                                                                    1100  ADCCLK = Input Clock / 7.0
                                                                                    #br#  1101  ADCCLK = Input Clock /
                                                                                    7.5 #br#  1110  ADCCLK = Input Clock
                                                                                    / 8.0 #br#  1111  ADCCLK = Input
                                                                                    Clock / 8.5 */
/* HSADC1_ADCCTL2_1[RESOLUTION] Bits */
#define HSADC1_ADCCTL2_1_RESOLUTION_OFS          (6)                             /* !< RESOLUTION Offset */
#define HSADC1_ADCCTL2_1_RESOLUTION_MASK         ((uint32_t)0x00000040U)         /* !< SOC Conversion Resolution. Selects
                                                                                    the resolution of the converter. Use
                                                                                    the AdcSetMode function to change the
                                                                                    resolution. #br#  0  12-bit
                                                                                    resolution #br#  1  16-bit resolution */
/* HSADC1_ADCCTL2_1[SIGNALMODE] Bits */
#define HSADC1_ADCCTL2_1_SIGNALMODE_OFS          (7)                             /* !< SIGNALMODE Offset */
#define HSADC1_ADCCTL2_1_SIGNALMODE_MASK         ((uint32_t)0x00000080U)         /* !< SOC Signaling Mode. Selects the
                                                                                    input mode of the converter. Use the
                                                                                    AdcSetMode function to change the
                                                                                    signal mode. #br#  0  Single-ended
                                                                                    #br#  1  Differential */
/* HSADC1_ADCCTL2_1[DEBUGMODE] Bits */
#define HSADC1_ADCCTL2_1_DEBUGMODE_OFS           (8)                             /* !< DEBUGMODE Offset */
#define HSADC1_ADCCTL2_1_DEBUGMODE_MASK          ((uint32_t)0x00000100U)         /* !< ADC Clocking Mode. Selects the
                                                                                    number of ADCCLK pulses to be
                                                                                    generated to the converter. #br#  0
                                                                                    Default mode - Generate only
                                                                                    sufficient number of clocks based on
                                                                                    Resolution and Sample Cap reset. #br#
                                                                                    1  Debug mode - Generate 2
                                                                                    additional ADCCLK pulses for every
                                                                                    conversion. */

/* HSADC1_ADCBURSTCTL_LITE_ Bits */
/* HSADC1_ADCBURSTCTL_LITE_[BURSTTRIGSEL] Bits */
#define HSADC1_ADCBURSTCTL_LITE__BURSTTRIGSEL_OFS (0)                             /* !< BURSTTRIGSEL Offset */
#define HSADC1_ADCBURSTCTL_LITE__BURSTTRIGSEL_MASK ((uint32_t)0x0000001FU)         /* !< SOC Burst Trigger Source Select.
                                                                                    Configures which trigger will start a
                                                                                    burst conversion sequence. #br#
                                                                                    #br#Note: SOCFRC1 register can always
                                                                                    be used to software trigger SOCs in
                                                                                    addition to any hardware trigger
                                                                                    configuration. #br#  00h  BURSTTRIG0
                                                                                    - Software only #br#  01h - 3Fh -
                                                                                    Hardware Triggers */
/* HSADC1_ADCBURSTCTL_LITE_[BURSTSIZE] Bits */
#define HSADC1_ADCBURSTCTL_LITE__BURSTSIZE_OFS   (8)                             /* !< BURSTSIZE Offset */
#define HSADC1_ADCBURSTCTL_LITE__BURSTSIZE_MASK  ((uint32_t)0x00000F00U)         /* !< SOC Burst Size Select. This bit
                                                                                    field determines how many SOCs are
                                                                                    converted when a burst conversion
                                                                                    sequence is started. The first SOC
                                                                                    converted is defined by the round
                                                                                    robin pointer, which is advanced as
                                                                                    each SOC is converted. #br# #br#  0h
                                                                                    1 SOC converted #br#  1h  2 SOCs
                                                                                    converted #br#  2h  3 SOCs converted
                                                                                    #br#  3h  4 SOCs converted #br#  4h
                                                                                    5 SOCs converted #br#  5h  6 SOCs
                                                                                    converted #br#  6h  7 SOCs converted
                                                                                    #br#  7h  8 SOCs converted #br#  8h
                                                                                    9 SOCs converted #br#  9h  10 SOCs
                                                                                    converted #br#  Ah  11 SOCs converted
                                                                                    #br#  Bh  12 SOCs converted #br#  Ch
                                                                                    13 SOCs converted #br#  Dh  14 SOCs
                                                                                    converted #br#  Eh  15 SOCs converted
                                                                                    #br#  Fh  16 SOCs converted */
/* HSADC1_ADCBURSTCTL_LITE_[BURSTEN] Bits */
#define HSADC1_ADCBURSTCTL_LITE__BURSTEN_OFS     (15)                            /* !< BURSTEN Offset */
#define HSADC1_ADCBURSTCTL_LITE__BURSTEN_MASK    ((uint32_t)0x00008000U)         /* !< SOC Burst Mode Enable. This bit
                                                                                    enables the SOC Burst Mode of
                                                                                    operation. #br# #br#  0  Burst mode
                                                                                    is disabled. #br#  1  Burst mode is
                                                                                    enabled. */

