TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */
/* HSADC1_ADCINTFLG_4INT[ADCDMAINT2] Bits */
#define HSADC1_ADCINTFLG_4INT_ADCDMAINT2_OFS     (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC1_ADCINTFLG_4INT_ADCDMAINT2_MASK    ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    DMA interrupt is placed in continue
                                                                                    to interrupt mode (DMAINTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINTFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC1_ADCINTFLG_4INT[ADCDMAINT3] Bits */
#define HSADC1_ADCINTFLG_4INT_ADCDMAINT3_OFS     (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC1_ADCINTFLG_4INT_ADCDMAINT3_MASK    ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */
/* HSADC1_ADCINTFLG_4INT[ADCDMAINT4] Bits */
#define HSADC1_ADCINTFLG_4INT_ADCDMAINT4_OFS     (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC1_ADCINTFLG_4INT_ADCDMAINT4_MASK    ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interru4pt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */

