TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCINTSOCSEL1_1 Bits */
/* HSADC1_ADCINTSOCSEL1_1[SOC0] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC0_OFS          (0)                             /* !< SOC0 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC0_MASK         ((uint32_t)0x00000003U)         /* !< SOC0 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC0. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC0. TRIGSEL field alone
                                                                                    determines SOC0 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC0. #br#  10
                                                                                    ADCINT2 will trigger SOC0. #br#  11
                                                                                    EOC[N-1] will trigger SOC0. #br#N -
                                                                                    Total number of SOCs supported */
/* HSADC1_ADCINTSOCSEL1_1[SOC1] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC1_OFS          (2)                             /* !< SOC1 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC1_MASK         ((uint32_t)0x0000000CU)         /* !< SOC1 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC1. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC1. TRIGSEL field alone
                                                                                    determines SOC1 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC1. #br#  10
                                                                                    ADCINT2 will trigger SOC1. #br#  11
                                                                                    EOC0 will trigger SOC1. */
/* HSADC1_ADCINTSOCSEL1_1[SOC2] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC2_OFS          (4)                             /* !< SOC2 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC2_MASK         ((uint32_t)0x00000030U)         /* !< SOC2 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC2. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC2. TRIGSEL field alone
                                                                                    determines SOC2 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC2. #br#  10
                                                                                    ADCINT2 will trigger SOC2. #br#  11
                                                                                    EOC1 will trigger SOC2. */
/* HSADC1_ADCINTSOCSEL1_1[SOC3] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC3_OFS          (6)                             /* !< SOC3 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC3_MASK         ((uint32_t)0x000000C0U)         /* !< SOC3 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC3. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC3. TRIGSEL field alone
                                                                                    determines SOC3 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC3. #br#  10
                                                                                    ADCINT2 will trigger SOC3. #br#  11
                                                                                    EOC2 will trigger SOC3. */
/* HSADC1_ADCINTSOCSEL1_1[SOC4] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC4_OFS          (8)                             /* !< SOC4 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC4_MASK         ((uint32_t)0x00000300U)         /* !< SOC4 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC4. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC4. TRIGSEL field alone
                                                                                    determines SOC4 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC4. #br#  10
                                                                                    ADCINT2 will trigger SOC4. #br#  11
                                                                                    EOC3 will trigger SOC4. */
/* HSADC1_ADCINTSOCSEL1_1[SOC5] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC5_OFS          (10)                            /* !< SOC5 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC5_MASK         ((uint32_t)0x00000C00U)         /* !< SOC5 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC5. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC5. TRIGSEL field alone
                                                                                    determines SOC5 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC5. #br#  10
                                                                                    ADCINT2 will trigger SOC5. #br#  11
                                                                                    EOC4 will trigger SOC5. */
/* HSADC1_ADCINTSOCSEL1_1[SOC6] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC6_OFS          (12)                            /* !< SOC6 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC6_MASK         ((uint32_t)0x00003000U)         /* !< SOC6 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC6. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC6. TRIGSEL field alone
                                                                                    determines SOC6 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC6. #br#  10
                                                                                    ADCINT2 will trigger SOC6. #br#  11
                                                                                    EOC5 will trigger SOC6. */
/* HSADC1_ADCINTSOCSEL1_1[SOC7] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC7_OFS          (14)                            /* !< SOC7 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC7_MASK         ((uint32_t)0x0000C000U)         /* !< SOC7 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC7. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC7. TRIGSEL field alone
                                                                                    determines SOC7 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC7. #br#  10
                                                                                    ADCINT2 will trigger SOC7. #br#  11
                                                                                    EOC6 will trigger SOC7. */
/* HSADC1_ADCINTSOCSEL1_1[SOC8] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC8_OFS          (16)                            /* !< SOC8 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC8_MASK         ((uint32_t)0x00030000U)         /* !< SOC8 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC8. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC8. TRIGSEL field alone
                                                                                    determines SOC8 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC8. #br#  10
                                                                                    ADCINT2 will trigger SOC8. #br#  11
                                                                                    EOC7 will trigger SOC8. */
/* HSADC1_ADCINTSOCSEL1_1[SOC9] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC9_OFS          (18)                            /* !< SOC9 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC9_MASK         ((uint32_t)0x000C0000U)         /* !< SOC9 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC9. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC9. TRIGSEL field alone
                                                                                    determines SOC9 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC9. #br#  10
                                                                                    ADCINT2 will trigger SOC1. #br#  11
                                                                                    EOC8 will trigger SOC9. */
/* HSADC1_ADCINTSOCSEL1_1[SOC10] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC10_OFS         (20)                            /* !< SOC10 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC10_MASK        ((uint32_t)0x00300000U)         /* !< SOC10 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC10. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC10. TRIGSEL field alone
                                                                                    determines SOC10 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC10. #br#  10
                                                                                    ADCINT2 will trigger SOC10. #br#  11
                                                                                    EOC9 will trigger SOC10. */
/* HSADC1_ADCINTSOCSEL1_1[SOC11] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC11_OFS         (22)                            /* !< SOC11 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC11_MASK        ((uint32_t)0x00C00000U)         /* !< SOC11 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC11. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC11. TRIGSEL field alone
                                                                                    determines SOC11 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC11. #br#  10
                                                                                    ADCINT2 will trigger SOC11. #br#  11
                                                                                    EOC10 will trigger SOC11. */
/* HSADC1_ADCINTSOCSEL1_1[SOC12] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC12_OFS         (24)                            /* !< SOC12 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC12_MASK        ((uint32_t)0x03000000U)         /* !< SOC12 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC12. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC12. TRIGSEL field alone
                                                                                    determines SOC12 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC12. #br#  10
                                                                                    ADCINT2 will trigger SOC12. #br#  11
                                                                                    EOC11 will trigger SOC12. */
/* HSADC1_ADCINTSOCSEL1_1[SOC13] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC13_OFS         (26)                            /* !< SOC13 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC13_MASK        ((uint32_t)0x0C000000U)         /* !< SOC13 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC13. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC13. TRIGSEL field alone
                                                                                    determines SOC13 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC13. #br#  10
                                                                                    ADCINT2 will trigger SOC13. #br#  11
                                                                                    EOC12 will trigger SOC13. */
/* HSADC1_ADCINTSOCSEL1_1[SOC14] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC14_OFS         (28)                            /* !< SOC14 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC14_MASK        ((uint32_t)0x30000000U)         /* !< SOC14 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC14. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC14. TRIGSEL field alone
                                                                                    determines SOC14 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC14. #br#  10
                                                                                    ADCINT2 will trigger SOC14. #br#  11
                                                                                    EOC13 will trigger SOC14. */
/* HSADC1_ADCINTSOCSEL1_1[SOC15] Bits */
#define HSADC1_ADCINTSOCSEL1_1_SOC15_OFS         (30)                            /* !< SOC15 Offset */
#define HSADC1_ADCINTSOCSEL1_1_SOC15_MASK        ((uint32_t)0xC0000000U)         /* !< SOC15 ADC Interrupt Trigger Select.
                                                                                    Selects which, if any, ADCINT
                                                                                    triggers SOC15. The trigger selected
                                                                                    in this field is in addition to the
                                                                                    TRIGSEL field in the ADCSOCxCTL
                                                                                    register. #br#  00  No ADCINT will
                                                                                    trigger SOC15. TRIGSEL field alone
                                                                                    determines SOC15 trigger. #br#  01
                                                                                    ADCINT1 will trigger SOC15. #br#  10
                                                                                    ADCINT2 will trigger SOC15. #br#  11
                                                                                    EOC14 will trigger SOC15. */

