TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCSOCFLG1_LITE_FRC Bits */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC0] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC0_OFS      (0)                             /* !< SOC0 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC0_MASK     ((uint32_t)0x00000001U)         /* !< SOC0 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC0
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC0 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC0. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC0 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC1] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC1_OFS      (1)                             /* !< SOC1 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC1_MASK     ((uint32_t)0x00000002U)         /* !< SOC1 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC1
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC1 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC1. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC1 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC2] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC2_OFS      (2)                             /* !< SOC2 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC2_MASK     ((uint32_t)0x00000004U)         /* !< SOC2 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC2
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC2 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC2. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC2 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC3] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC3_OFS      (3)                             /* !< SOC3 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC3_MASK     ((uint32_t)0x00000008U)         /* !< SOC3 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC3
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC3 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC3. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC3 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC4] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC4_OFS      (4)                             /* !< SOC4 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC4_MASK     ((uint32_t)0x00000010U)         /* !< SOC4 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC4
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC4 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC4. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC4 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC5] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC5_OFS      (5)                             /* !< SOC5 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC5_MASK     ((uint32_t)0x00000020U)         /* !< SOC5 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC5
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC5 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC5. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC5 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC6] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC6_OFS      (6)                             /* !< SOC6 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC6_MASK     ((uint32_t)0x00000040U)         /* !< SOC6 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC6
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC6 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC6. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC6 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC7] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC7_OFS      (7)                             /* !< SOC7 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC7_MASK     ((uint32_t)0x00000080U)         /* !< SOC7 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC7
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC7 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC7. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC7 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC8] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC8_OFS      (8)                             /* !< SOC8 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC8_MASK     ((uint32_t)0x00000100U)         /* !< SOC8 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC8
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC8 flag bit to 1. This will
                                                                                    cause a conversion to start once
                                                                                    priority is given to SOC8. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to clear the SOC8 bit in the
                                                                                    ADCSOCFLG1 register, then software
                                                                                    has priority and the ADCSOCFLG1 bit
                                                                                    will be set. In this case the
                                                                                    overflow bit in the ADCSOCOVF1
                                                                                    register will not be affected
                                                                                    regardless of whether the ADCSOCFLG1
                                                                                    bit was previously set or not. */
/* HSADC1_ADCSOCFLG1_LITE_FRC[SOC9] Bits */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC9_OFS      (9)                             /* !< SOC9 Offset */
#define HSADC1_ADCSOCFLG1_LITE_FRC_SOC9_MASK     ((uint32_t)0x00000200U)         /* !< SOC9 Force Start of Conversion Bit.
                                                                                    Writing a 1 will force to 1 the SOC9
                                                                                    flag in the ADCSOCFLG1 register. This
                                                                                    can be used to initiate a software
                                                                                    initiated conversion. Writes of 0 are
                                                                                    ignored. This bit will always read as
                                                                                    a 0. #br# #br#  0  No action. #br#  1
                                                                                    Force SOC9 flag bit to 1. This will
