TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCSOCOVF1_M33_ Bits */
/* HSADC1_ADCSOCOVF1_M33_[SOC0OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC0OVF_OFS       (0)                             /* !< SOC0OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC0OVF_MASK      ((uint32_t)0x00000001U)         /* !< SOC0 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC0 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC0 event was already
                                                                                    pending. #br# #br#  0  No SOC0 event
                                                                                    overflow. #br#  1  SOC0 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC0 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC1OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC1OVF_OFS       (1)                             /* !< SOC1OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC1OVF_MASK      ((uint32_t)0x00000002U)         /* !< SOC1 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC1 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC1 event was already
                                                                                    pending. #br# #br#  0  No SOC1 event
                                                                                    overflow. #br#  1  SOC1 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC1 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC2OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC2OVF_OFS       (2)                             /* !< SOC2OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC2OVF_MASK      ((uint32_t)0x00000004U)         /* !< SOC2 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC2 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC2 event was already
                                                                                    pending. #br# #br#  0  No SOC2 event
                                                                                    overflow. #br#  1  SOC2 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC2 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC3OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC3OVF_OFS       (3)                             /* !< SOC3OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC3OVF_MASK      ((uint32_t)0x00000008U)         /* !< SOC3 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC3 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC3 event was already
                                                                                    pending. #br# #br#  0  No SOC3 event
                                                                                    overflow. #br#  1  SOC3 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC3 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC4OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC4OVF_OFS       (4)                             /* !< SOC4OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC4OVF_MASK      ((uint32_t)0x00000010U)         /* !< SOC4 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC4 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC4 event was already
                                                                                    pending. #br# #br#  0  No SOC4 event
                                                                                    overflow. #br#  1  SOC4 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC4 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC5OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC5OVF_OFS       (5)                             /* !< SOC5OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC5OVF_MASK      ((uint32_t)0x00000020U)         /* !< SOC5 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC5 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC5 event was already
                                                                                    pending. #br# #br#  0  No SOC5 event
                                                                                    overflow. #br#  1  SOC5 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC5 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC6OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC6OVF_OFS       (6)                             /* !< SOC6OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC6OVF_MASK      ((uint32_t)0x00000040U)         /* !< SOC6 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC6 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC6 event was already
                                                                                    pending. #br# #br#  0  No SOC6 event
                                                                                    overflow. #br#  1  SOC6 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC6 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC7OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC7OVF_OFS       (7)                             /* !< SOC7OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC7OVF_MASK      ((uint32_t)0x00000080U)         /* !< SOC7 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC7 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC7 event was already
                                                                                    pending. #br# #br#  0  No SOC7 event
                                                                                    overflow. #br#  1  SOC7 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC7 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC8OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC8OVF_OFS       (8)                             /* !< SOC8OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC8OVF_MASK      ((uint32_t)0x00000100U)         /* !< SOC8 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC8 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC8 event was already
                                                                                    pending. #br# #br#  0  No SOC8 event
                                                                                    overflow. #br#  1  SOC8 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC8 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC9OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC9OVF_OFS       (9)                             /* !< SOC9OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC9OVF_MASK      ((uint32_t)0x00000200U)         /* !< SOC9 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC9 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC9 event was already
                                                                                    pending. #br# #br#  0  No SOC9 event
                                                                                    overflow. #br#  1  SOC9 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC9 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC10OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC10OVF_OFS      (10)                            /* !< SOC10OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC10OVF_MASK     ((uint32_t)0x00000400U)         /* !< SOC10 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC10 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC10 event was already
                                                                                    pending. #br# #br#  0  No SOC10 event
                                                                                    overflow. #br#  1  SOC10 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC10 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC11OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC11OVF_OFS      (11)                            /* !< SOC11OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC11OVF_MASK     ((uint32_t)0x00000800U)         /* !< SOC11 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC11 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC11 event was already
                                                                                    pending. #br# #br#  0  No SOC11 event
                                                                                    overflow. #br#  1  SOC11 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC11 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC12OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC12OVF_OFS      (12)                            /* !< SOC12OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC12OVF_MASK     ((uint32_t)0x00001000U)         /* !< SOC12 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC12 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC12 event was already
                                                                                    pending. #br# #br#  0  No SOC12 event
                                                                                    overflow. #br#  1  SOC12 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC12 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC13OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC13OVF_OFS      (13)                            /* !< SOC13OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC13OVF_MASK     ((uint32_t)0x00002000U)         /* !< SOC13 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC13 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC13 event was already
                                                                                    pending. #br# #br#  0  No SOC13 event
                                                                                    overflow. #br#  1  SOC13 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC13 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC14OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC14OVF_OFS      (14)                            /* !< SOC14OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC14OVF_MASK     ((uint32_t)0x00004000U)         /* !< SOC14 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC14 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC14 event was already
                                                                                    pending. #br# #br#  0  No SOC14 event
                                                                                    overflow. #br#  1  SOC14 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC14 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */
/* HSADC1_ADCSOCOVF1_M33_[SOC15OVF] Bits */
#define HSADC1_ADCSOCOVF1_M33__SOC15OVF_OFS      (15)                            /* !< SOC15OVF Offset */
#define HSADC1_ADCSOCOVF1_M33__SOC15OVF_MASK     ((uint32_t)0x00008000U)         /* !< SOC15 Start of Conversion Overflow
                                                                                    Flag. Indicates an SOC15 event was
                                                                                    generated in hardware while an
                                                                                    existing SOC15 event was already
                                                                                    pending. #br# #br#  0  No SOC15 event
                                                                                    overflow. #br#  1  SOC15 event
                                                                                    overflow. #br# #br#An overflow
                                                                                    condition does not stop SOC15 events
                                                                                    from being processed. It simply is an
                                                                                    indication that a hardware trigger
                                                                                    was missed. */

