TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC12 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC1_ADCSOCOVFCLR1_1[SOC13OVF] Bits */
#define HSADC1_ADCSOCOVFCLR1_1_SOC13OVF_OFS      (13)                            /* !< SOC13OVF Offset */
#define HSADC1_ADCSOCOVFCLR1_1_SOC13OVF_MASK     ((uint32_t)0x00002000U)         /* !< SOC13 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC13 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC13 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC1_ADCSOCOVFCLR1_1[SOC14OVF] Bits */
#define HSADC1_ADCSOCOVFCLR1_1_SOC14OVF_OFS      (14)                            /* !< SOC14OVF Offset */
#define HSADC1_ADCSOCOVFCLR1_1_SOC14OVF_MASK     ((uint32_t)0x00004000U)         /* !< SOC14 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC14 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC14 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC1_ADCSOCOVFCLR1_1[SOC15OVF] Bits */
#define HSADC1_ADCSOCOVFCLR1_1_SOC15OVF_OFS      (15)                            /* !< SOC15OVF Offset */
#define HSADC1_ADCSOCOVFCLR1_1_SOC15OVF_MASK     ((uint32_t)0x00008000U)         /* !< SOC15 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC15 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC15 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */

/* HSADC1_ADCSOC0CTL_M33_ Bits */
/* HSADC1_ADCSOC0CTL_M33_[CHSEL] Bits */
#define HSADC1_ADCSOC0CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC0CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC0 Channel Select. Selects the
                                                                                    channel to be converted when SOC0 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC0CTL_M33_[COMPEN] Bits */
#define HSADC1_ADCSOC0CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC0CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC0 Threshold comparator enable. */

/* HSADC1_ADCSOC0CTL_1 Bits */
/* HSADC1_ADCSOC0CTL_1[CHSEL] Bits */
#define HSADC1_ADCSOC0CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC0CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC0 Channel Select. Selects the
                                                                                    channel to be converted when SOC0 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC0CTL_1[COMPEN] Bits */
#define HSADC1_ADCSOC0CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC0CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC0 Threshold comparator enable. */

/* HSADC1_ADCSOC1CTL_M33_ Bits */
/* HSADC1_ADCSOC1CTL_M33_[CHSEL] Bits */
#define HSADC1_ADCSOC1CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC1CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC1 Channel Select. Selects the
                                                                                    channel to be converted when SOC1 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC1CTL_M33_[COMPEN] Bits */
#define HSADC1_ADCSOC1CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC1CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC1 Threshold comparator enable. */

/* HSADC1_ADCSOC1CTL_1 Bits */
/* HSADC1_ADCSOC1CTL_1[CHSEL] Bits */
#define HSADC1_ADCSOC1CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC1CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC1 Channel Select. Selects the
                                                                                    channel to be converted when SOC1 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC1CTL_1[COMPEN] Bits */
#define HSADC1_ADCSOC1CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC1CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC1 Threshold comparator enable. */

/* HSADC1_ADCSOC2CTL_M33_ Bits */
/* HSADC1_ADCSOC2CTL_M33_[CHSEL] Bits */
#define HSADC1_ADCSOC2CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC2CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC2 Channel Select. Selects the
                                                                                    channel to be converted when SOC2 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC2CTL_M33_[COMPEN] Bits */
#define HSADC1_ADCSOC2CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC2CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC2 Threshold comparator enable. */

/* HSADC1_ADCSOC2CTL_1 Bits */
/* HSADC1_ADCSOC2CTL_1[CHSEL] Bits */
#define HSADC1_ADCSOC2CTL_1_CHSEL_OFS            (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC2CTL_1_CHSEL_MASK           ((uint32_t)0x000F8000U)         /* !< SOC2 Channel Select. Selects the
                                                                                    channel to be converted when SOC2 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC2CTL_1[COMPEN] Bits */
#define HSADC1_ADCSOC2CTL_1_COMPEN_OFS           (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC2CTL_1_COMPEN_MASK          ((uint32_t)0x02000000U)         /* !< SOC2 Threshold comparator enable. */

/* HSADC1_ADCSOC3CTL_M33_ Bits */
/* HSADC1_ADCSOC3CTL_M33_[CHSEL] Bits */
#define HSADC1_ADCSOC3CTL_M33__CHSEL_OFS         (15)                            /* !< CHSEL Offset */
#define HSADC1_ADCSOC3CTL_M33__CHSEL_MASK        ((uint32_t)0x000F8000U)         /* !< SOC3 Channel Select. Selects the
                                                                                    channel to be converted when SOC3 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC1_ADCSOC3CTL_M33_[COMPEN] Bits */
#define HSADC1_ADCSOC3CTL_M33__COMPEN_OFS        (25)                            /* !< COMPEN Offset */
#define HSADC1_ADCSOC3CTL_M33__COMPEN_MASK       ((uint32_t)0x02000000U)         /* !< SOC3 Threshold comparator enable. */

