TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB1TRIPLO_1 Bits */
/* HSADC1_ADCPPB1TRIPLO_1[LIMITLO] Bits */
#define HSADC1_ADCPPB1TRIPLO_1_LIMITLO_OFS       (0)                             /* !< LIMITLO Offset */
#define HSADC1_ADCPPB1TRIPLO_1_LIMITLO_MASK      ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 1 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB1TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

/* HSADC1_ADCPPB2CONFIG_M33_ Bits */
/* HSADC1_ADCPPB2CONFIG_M33_[CBCEN] Bits */
#define HSADC1_ADCPPB2CONFIG_M33__CBCEN_OFS      (5)                             /* !< CBCEN Offset */
#define HSADC1_ADCPPB2CONFIG_M33__CBCEN_MASK     ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC1_ADCPPB2CONFIG_M33_[TWOSCOMPEN] Bits */
#define HSADC1_ADCPPB2CONFIG_M33__TWOSCOMPEN_OFS (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC1_ADCPPB2CONFIG_M33__TWOSCOMPEN_MASK ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 2 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB2RESULT register. #br# #br#  0
                                                                                    ADCPPB2RESULT = ADCRESULTx -
                                                                                    ADCPPB2OFFREF #br#  1  ADCPPB2RESULT
                                                                                    = ADCPPB2OFFREF - ADCRESULTx */

/* HSADC1_ADCPPB2CONFIG_1 Bits */
/* HSADC1_ADCPPB2CONFIG_1[CBCEN] Bits */
#define HSADC1_ADCPPB2CONFIG_1_CBCEN_OFS         (5)                             /* !< CBCEN Offset */
#define HSADC1_ADCPPB2CONFIG_1_CBCEN_MASK        ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */
/* HSADC1_ADCPPB2CONFIG_1[TWOSCOMPEN] Bits */
#define HSADC1_ADCPPB2CONFIG_1_TWOSCOMPEN_OFS    (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC1_ADCPPB2CONFIG_1_TWOSCOMPEN_MASK   ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 2 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB2RESULT register. #br# #br#  0
                                                                                    ADCPPB2RESULT = ADCRESULTx -
                                                                                    ADCPPB2OFFREF #br#  1  ADCPPB2RESULT
                                                                                    = ADCPPB2OFFREF - ADCRESULTx */

