TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_REP1SPREAD Bits */
/* HSADC1_REP1SPREAD[SPREAD] Bits */
#define HSADC1_REP1SPREAD_SPREAD_OFS             (0)                             /* !< SPREAD Offset */
#define HSADC1_REP1SPREAD_SPREAD_MASK            ((uint32_t)0x0000FFFFU)         /* !< ADC trigger repeater 1 spread delay
                                                                                    configuration.  In oversampling mode,
                                                                                    defines the minimum number of SYSCLKs
                                                                                    to wait before creating the next
                                                                                    repeated trigger to the ADC.   #br#
                                                                                    #br#If SPREAD is less than the time
                                                                                    needed for all SOCs associated with
                                                                                    repeater 1 to sample and convert,
                                                                                    then the repeater will generate
                                                                                    triggers as fast as the ADC can
                                                                                    convert the associated conversions.
                                                                                    #br# #br#If SPREAD is greater than
                                                                                    the time needed for all SOCs
                                                                                    associated with repeater 1 to sample
                                                                                    and convert, then repeated triggers
                                                                                    to the ADC will be SPREAD SYSCLK
                                                                                    cycles apart.   #br# #br#0 =
                                                                                    oversampled repeated triggers occur
                                                                                    as fast as the ADC can sample and
                                                                                    convert associated SOCs #br#1 = time
                                                                                    between repeated triggers is at least
                                                                                    1 SYSCLKs #br#2 = time between
                                                                                    repeated triggers is at least 2
                                                                                    SYSCLKs #br#... #br#65535 =  time
                                                                                    between repeated triggers is at least
                                                                                    65535 SYSCLKs */
/* HSADC1_REP1SPREAD[SPREADCOUNT] Bits */
#define HSADC1_REP1SPREAD_SPREADCOUNT_OFS        (16)                            /* !< SPREADCOUNT Offset */
#define HSADC1_REP1SPREAD_SPREADCOUNT_MASK       ((uint32_t)0xFFFF0000U)         /* !< ADC trigger repeater 1 spread
                                                                                    status.  When a trigger is sent to
                                                                                    the ADC in oversampling mode, this
                                                                                    register will start counting down
                                                                                    from SPREAD until SPREADCOUNT equals
                                                                                    0.   #br# #br#The next repeated
                                                                                    trigger to the ADC in oversampling
                                                                                    mode will not occur until SPREADCOUNT
                                                                                    is 0 (minimum time is complete) and
                                                                                    REP1CTL.BUSY = 0 (SOCs associated
                                                                                    with trigger repeater 1 are no longer
                                                                                    pending). */

/* HSADC1_REP1FRC_LITE_ Bits */
/* HSADC1_REP1FRC_LITE_[SWFRC] Bits */
#define HSADC1_REP1FRC_LITE__SWFRC_OFS           (0)                             /* !< SWFRC Offset */
#define HSADC1_REP1FRC_LITE__SWFRC_MASK          ((uint32_t)0x00000001U)         /* !< Write 1 to force a trigger to
                                                                                    repeat block 1 input regardless of
                                                                                    the value of TRIGGER. #br# #br#Always
                                                                                    reads 0. */

/* HSADC1_REP1FRC_1 Bits */
/* HSADC1_REP1FRC_1[SWFRC] Bits */
#define HSADC1_REP1FRC_1_SWFRC_OFS               (0)                             /* !< SWFRC Offset */
#define HSADC1_REP1FRC_1_SWFRC_MASK              ((uint32_t)0x00000001U)         /* !< Write 1 to force a trigger to
                                                                                    repeat block 1 input regardless of
                                                                                    the value of TRIGGER. #br# #br#Always
                                                                                    reads 0. */

/* HSADC1_REP2CTL_LITE_ Bits */
/* HSADC1_REP2CTL_LITE_[MODE] Bits */
#define HSADC1_REP2CTL_LITE__MODE_OFS            (0)                             /* !< MODE Offset */
#define HSADC1_REP2CTL_LITE__MODE_MASK           ((uint32_t)0x00000001U)         /* !< ADC trigger repeater 2 mode
                                                                                    selection.  Select either
                                                                                    oversampling or undersampling mode.
                                                                                    #br# #br#In oversampling mode, when
                                                                                    the trigger selected by
                                                                                    REP2CTL.TRIGSEL is received, the
                                                                                    repeater will repeat the trigger
                                                                                    REP2N.NSEL + 1 times. #br# #br#In
                                                                                    undersampling mode, when the trigger
                                                                                    selected by REP2CTL.TRIGSEL is
                                                                                    received the first time, the repeater
                                                                                    will pass the trigger through.  The
                                                                                    next REP2N.NSEL triggers will be
                                                                                    ignored.   #br# #br#0 = oversampling
                                                                                    #br#1 = undersampling */
/* HSADC1_REP2CTL_LITE_[ACTIVEMODE] Bits */
#define HSADC1_REP2CTL_LITE__ACTIVEMODE_OFS      (1)                             /* !< ACTIVEMODE Offset */
#define HSADC1_REP2CTL_LITE__ACTIVEMODE_MASK     ((uint32_t)0x00000002U)         /* !< When a trigger is recived in
                                                                                    oversampling or undersampling mode
                                                                                    the value of MODE is copied to
                                                                                    ACTIVEMODE.  ACTIVEMODE determines if
                                                                                    the repeater will repeat of filter
                                                                                    triggers.  Changes to MODE while the
                                                                                    repeater is working therefore won't
                                                                                    cause any changes in functionality
                                                                                    until the module becomes idle and
                                                                                    then a new trigger is received.  #br#
                                                                                    #br#0 = module is oversampling #br#1
                                                                                    = module is undersampling */
/* HSADC1_REP2CTL_LITE_[MODULEBUSY] Bits */
#define HSADC1_REP2CTL_LITE__MODULEBUSY_OFS      (3)                             /* !< MODULEBUSY Offset */
#define HSADC1_REP2CTL_LITE__MODULEBUSY_MASK     ((uint32_t)0x00000008U)         /* !< ADC Trigger Repeater 2 Module Busy
                                                                                    indicator.  In oversampling mode:
                                                                                    #br# #br#0 = Repeater 2 is idle and
                                                                                    can accept a new repeated trigger in
                                                                                    oversampling mode #br#1 = Repeater 2
                                                                                    still has repeated triggers remaining
                                                                                    (NCOUNT > 0) or associated SOCs are
                                                                                    still pending (SOCBUSY is 1) #br#
                                                                                    #br#If a new oversampled trigger is
                                                                                    received while the module is still
                                                                                    busy, the TRIGGEROVF bit will be set
                                                                                    and the trigger will be ignored. */
/* HSADC1_REP2CTL_LITE_[SOCBUSY] Bits */
#define HSADC1_REP2CTL_LITE__SOCBUSY_OFS         (4)                             /* !< SOCBUSY Offset */
#define HSADC1_REP2CTL_LITE__SOCBUSY_MASK        ((uint32_t)0x00000010U)         /* !< ADC Trigger Repeater 2 Associated
                                                                                    SOCs Busy indicator.  In oversampling
                                                                                    mode: #br# #br#0 = no SOCs associated
                                                                                    with this repeater are pending #br#1
                                                                                    = SOCs associated with this repeater
                                                                                    are still pending #br# #br#The next
                                                                                    repeated trigger to the ADC in
                                                                                    oversampling mode will not occur
                                                                                    until SPREADCOUNT is 0 (minimum time
                                                                                    is complete) and REP2CTL.BUSY = 0
                                                                                    (SOCs associated with trigger
                                                                                    repeater 2 are no longer pending).
                                                                                    #br# #br#Note: If the ADC is in
                                                                                    burstmode and the BURSTTRIG is
                                                                                    Repeater 2, then all round-robin SOCs
                                                                                    are considered associated with this
                                                                                    repeater and the repeater will not
                                                                                    re-trigger until there are no pending
                                                                                    round-robin SOCs (in addition to any
                                                                                    associated pending high-priority
                                                                                    SOCs). */
/* HSADC1_REP2CTL_LITE_[PHASEOVF] Bits */
#define HSADC1_REP2CTL_LITE__PHASEOVF_OFS        (6)                             /* !< PHASEOVF Offset */
#define HSADC1_REP2CTL_LITE__PHASEOVF_MASK       ((uint32_t)0x00000040U)         /* !< ADC Trigger Repeater 2 Phase Delay
                                                                                    Overflow. #br# #br#Indicates that a
                                                                                    trigger was dropped because a trigger
                                                                                    arrived when the phase delay logic
                                                                                    was still waiting to send the delayed
                                                                                    trigger (PHASECOUNT was not 0).
                                                                                    #br# #br#Writing a 1 will clear this
                                                                                    flag. #br# #br#Note: If software sets
                                                                                    the clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC1_REP2CTL_LITE_[TRIGGEROVF] Bits */
#define HSADC1_REP2CTL_LITE__TRIGGEROVF_OFS      (7)                             /* !< TRIGGEROVF Offset */
#define HSADC1_REP2CTL_LITE__TRIGGEROVF_MASK     ((uint32_t)0x00000080U)         /* !< ADC Trigger Repeater 2 Oversampled
                                                                                    Trigger Overflow. #br# #br#Indicates
                                                                                    that a trigger was dropped because a
                                                                                    trigger arrived while the repeater
                                                                                    was still generating repeated
                                                                                    oversampled triggers (NCOUNT was not
                                                                                    0 or SOCs associated with Repeater 2
                                                                                    were still pending).   #br#
                                                                                    #br#Writing a 1 will clear this flag.
                                                                                    #br# #br#Note: This flag won't be set
                                                                                    in undersampling mode or when NSEL =
                                                                                    0; if a trigger arrives before the
                                                                                    previous SOCs have completed, the
                                                                                    trigger will be passed and the
                                                                                    overflow flags of the SOCs that were
                                                                                    still pending will be set.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority and the
                                                                                    overflow bit will remain set. */
/* HSADC1_REP2CTL_LITE_[TRIGGER] Bits */
#define HSADC1_REP2CTL_LITE__TRIGGER_OFS         (8)                             /* !< TRIGGER Offset */
#define HSADC1_REP2CTL_LITE__TRIGGER_MASK        ((uint32_t)0x00001F00U)         /* !< ADC Trigger Repeater 2 Trigger
                                                                                    Select.  Selects the trigger to
                                                                                    modify via oversampling or
                                                                                    undersampling. #br# #br#  00h
                                                                                    REPTRIG0 - Software only #br#
                                                                                    01h-1FH   Hardware triggers */
/* HSADC1_REP2CTL_LITE_[SYNCINSEL] Bits */
#define HSADC1_REP2CTL_LITE__SYNCINSEL_OFS       (16)                            /* !< SYNCINSEL Offset */
#define HSADC1_REP2CTL_LITE__SYNCINSEL_MASK      ((uint32_t)0x00070000U)         /* !< Trigger repeater 2 sync. input
                                                                                    select.  On a sync. event, all
                                                                                    registers in repeater 2 are reset to
                                                                                    a ready and waiting state.  Values of
                                                                                    NSEL, PHASE, and MODE are preserved.
                                                                                    #br# #br#Note: SOCs associated with
                                                                                    repeater 2 are not cleared.   #br#
                                                                                    #br#0h = Disable Syncin to Repeater 2
                                                                                    #br#1h  - 1Fh  = Hardware syncin
                                                                                    sources */
/* HSADC1_REP2CTL_LITE_[SWSYNC] Bits */
#define HSADC1_REP2CTL_LITE__SWSYNC_OFS          (23)                            /* !< SWSYNC Offset */
#define HSADC1_REP2CTL_LITE__SWSYNC_MASK         ((uint32_t)0x00800000U)         /* !< Trigger repeater 2 software force
                                                                                    sync.  On a sync. event, all
                                                                                    registers in repeater 2 are reset to
                                                                                    a ready and waiting state.  Values of
                                                                                    NSEL, PHASE, and MODE are preserved.
                                                                                    #br# #br#Note: SOCs associated with
                                                                                    repeater 2 are not cleared. */

