TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_REP2N_1 Bits */
/* HSADC1_REP2N_1[NSEL] Bits */
#define HSADC1_REP2N_1_NSEL_OFS                  (0)                             /* !< NSEL Offset */
#define HSADC1_REP2N_1_NSEL_MASK                 ((uint32_t)0x00000003U)         /* !< ADC Trigger Repeater 2 selection of
                                                                                    number of triggers. #br# #br#In
                                                                                    oversampling mode, selects the number
                                                                                    of repeated triggers. For each
                                                                                    trigger received corresponding to
                                                                                    REP2CTL.TRIGSEL, 2^NSEL triggers will
                                                                                    be generated.   #br# #br#0 = 1
                                                                                    trigger is generated (pass-through)
                                                                                    #br#1 = 2 triggers are generated
                                                                                    #br#2 = 4 triggers are generated
                                                                                    #br#3 = 8 triggers are generated
                                                                                    #br# #br#In undersampling mode,
                                                                                    selects the number triggers to be
                                                                                    supressed. 1 out NSEL + 1 triggers
                                                                                    received corresponding to
                                                                                    REP2CTL.TRIGSEL will be passed
                                                                                    through (the first trigger will be
                                                                                    passed through and the subsequent
                                                                                    NSEL triggers will be supressed).
                                                                                    #br# #br#0 = all triggers are passed
                                                                                    #br#1 = 1 out of 2 triggers are
                                                                                    passed #br#2 = 1 out of 3 triggers
                                                                                    are passed #br#... #br#127 = 1 out of
                                                                                    128 triggers are passed */
/* HSADC1_REP2N_1[NCOUNT] Bits */
#define HSADC1_REP2N_1_NCOUNT_OFS                (16)                            /* !< NCOUNT Offset */
#define HSADC1_REP2N_1_NCOUNT_MASK               ((uint32_t)0x00070000U)         /* !< ADC trigger repeater 2 trigger
                                                                                    count.   #br# #br#Indicates the
                                                                                    number of triggers remaining to be
                                                                                    generated.  If a trigger is received
                                                                                    corresponding to REP2CTL.TRIGSEL
                                                                                    while NCOUNT is not 0 (the repeater
                                                                                    is still busy generating the repeated
                                                                                    triggers) then the trigger will be
                                                                                    ignored and REP2CTL.TRIGOVF will be
                                                                                    set to 1. */

/* HSADC1_REP2PHASE Bits */
/* HSADC1_REP2PHASE[PHASE] Bits */
#define HSADC1_REP2PHASE_PHASE_OFS               (0)                             /* !< PHASE Offset */
#define HSADC1_REP2PHASE_PHASE_MASK              ((uint32_t)0x0000FFFFU)         /* !< ADC trigger repeater 2 phase delay
                                                                                    configuration.  Defines the number of
                                                                                    SYSCLKs to delay the selected trigger
                                                                                    before passing it on to the
                                                                                    re-triggering logic.   #br# #br#0 =
                                                                                    trigger is passed through without
                                                                                    delay #br#1 = trigger is delayed by 1
                                                                                    SYSCLK #br#2 = trigger is delayed by
                                                                                    2 SYSCLKs #br#... #br#65535 = trigger
                                                                                    is delayed by 65535 SYSCLKs */
/* HSADC1_REP2PHASE[PHASECOUNT] Bits */
#define HSADC1_REP2PHASE_PHASECOUNT_OFS          (16)                            /* !< PHASECOUNT Offset */
#define HSADC1_REP2PHASE_PHASECOUNT_MASK         ((uint32_t)0xFFFF0000U)         /* !< ADC trigger repeater 2 phase delay
                                                                                    status.  When the trigger selected by
                                                                                    REP2CTL.TRIGSEL is received, this
                                                                                    register will start counting down
                                                                                    from PHASECOUNT until the counter
                                                                                    reaches 0, at which point the trigger
                                                                                    will be passed on to the repeater
                                                                                    re-trigger logic.  #br# #br#If the
                                                                                    trigger selected by REP2CTL.TRIGSEL
                                                                                    is recieved when PHASECOUNT is not 0
                                                                                    (the phase delay logic is busy from
                                                                                    the previous trigger) then the new
                                                                                    trigger will be ignored and
                                                                                    REP2CTL.PHASEOVF will be set to 1. */

/* HSADC1_REP2SPREAD Bits */
/* HSADC1_REP2SPREAD[SPREAD] Bits */
#define HSADC1_REP2SPREAD_SPREAD_OFS             (0)                             /* !< SPREAD Offset */
#define HSADC1_REP2SPREAD_SPREAD_MASK            ((uint32_t)0x0000FFFFU)         /* !< ADC trigger repeater 2 spread delay
                                                                                    configuration.  In oversampling mode,
                                                                                    defines the minimum number of SYSCLKs
                                                                                    to wait before creating the next
                                                                                    repeated trigger to the ADC.   #br#
                                                                                    #br#If SPREAD is less than the time
                                                                                    needed for all SOCs associated with
                                                                                    repeater 2 to sample and convert,
                                                                                    then the repeater will generate
                                                                                    triggers as fast as the ADC can
                                                                                    convert the associated conversions.
                                                                                    #br# #br#If SPREAD is greater than
                                                                                    the time needed for all SOCs
                                                                                    associated with repeater 2 to sample
                                                                                    and convert, then repeated triggers
                                                                                    to the ADC will be SPREAD SYSCLK
                                                                                    cycles apart.   #br# #br#0 =
                                                                                    oversampled repeated triggers occur
                                                                                    as fast as the ADC can sample and
                                                                                    convert associated SOCs #br#1 = time
                                                                                    between repeated triggers is at least
                                                                                    1 SYSCLKs #br#2 = time between
                                                                                    repeated triggers is at least 2
                                                                                    SYSCLKs #br#... #br#65535 =  time
                                                                                    between repeated triggers is at least
                                                                                    65535 SYSCLKs */
/* HSADC1_REP2SPREAD[SPREADCOUNT] Bits */
#define HSADC1_REP2SPREAD_SPREADCOUNT_OFS        (16)                            /* !< SPREADCOUNT Offset */
#define HSADC1_REP2SPREAD_SPREADCOUNT_MASK       ((uint32_t)0xFFFF0000U)         /* !< ADC trigger repeater 2 spread
                                                                                    status.  When a trigger is sent to
                                                                                    the ADC in oversampling mode, this
                                                                                    register will start counting down
                                                                                    from SPREAD until SPREADCOUNT equals
                                                                                    0.   #br# #br#The next repeated
                                                                                    trigger to the ADC in oversampling
                                                                                    mode will not occur until SPREADCOUNT
                                                                                    is 0 (minimum time is complete) and
                                                                                    REP2CTL.BUSY = 0 (SOCs associated
                                                                                    with trigger repeater 2 are no longer
                                                                                    pending). */

/* HSADC1_REP2FRC_LITE_ Bits */
/* HSADC1_REP2FRC_LITE_[SWFRC] Bits */
#define HSADC1_REP2FRC_LITE__SWFRC_OFS           (0)                             /* !< SWFRC Offset */
#define HSADC1_REP2FRC_LITE__SWFRC_MASK          ((uint32_t)0x00000001U)         /* !< Write 1 to force a trigger to
                                                                                    repeat block 2 input regardless of
                                                                                    the value of TRIGGER. #br# #br#Always
                                                                                    reads 0. */

