TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB3CONFIG2_1 Bits */
/* HSADC1_ADCPPB3CONFIG2_1[SHIFT] Bits */
#define HSADC1_ADCPPB3CONFIG2_1_SHIFT_OFS        (0)                             /* !< SHIFT Offset */
#define HSADC1_ADCPPB3CONFIG2_1_SHIFT_MASK       ((uint32_t)0x00000007U)         /* !< Post Processing Block 3 right
                                                                                    shift.  Defines the number of bits to
                                                                                    right shift PSUM before loading into
                                                                                    the final SUM.   #br# #br#0 : no
                                                                                    right shift #br#1 : SUM = PSUM >> 1
                                                                                    #br#2 : SUM = PSUM >> 2 #br#... #br#7
                                                                                    : SUM = PSUM >> 7 */
/* HSADC1_ADCPPB3CONFIG2_1[SYNCINSEL] Bits */
#define HSADC1_ADCPPB3CONFIG2_1_SYNCINSEL_OFS    (4)                             /* !< SYNCINSEL Offset */
#define HSADC1_ADCPPB3CONFIG2_1_SYNCINSEL_MASK   ((uint32_t)0x00000070U)         /* !< PPB 3 sync. input select.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.   #br#Refer to SOC
                                                                                    spec for details */
/* HSADC1_ADCPPB3CONFIG2_1[SWSYNC] Bits */
#define HSADC1_ADCPPB3CONFIG2_1_SWSYNC_OFS       (11)                            /* !< SWSYNC Offset */
#define HSADC1_ADCPPB3CONFIG2_1_SWSYNC_MASK      ((uint32_t)0x00000800U)         /* !< PPB 3 software force sync.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.  #br# #br#Note: In
                                                                                    the case where the software force
                                                                                    occurs at the same time that a new
                                                                                    sample is added to the PSUM and the
                                                                                    PSUM is being used for a high or low
                                                                                    limit compare, then the comparison
                                                                                    will not occur. */
/* HSADC1_ADCPPB3CONFIG2_1[OSINTSEL] Bits */
#define HSADC1_ADCPPB3CONFIG2_1_OSINTSEL_OFS     (12)                            /* !< OSINTSEL Offset */
#define HSADC1_ADCPPB3CONFIG2_1_OSINTSEL_MASK    ((uint32_t)0x00001000U)         /* !< Post Processing Block 3 Interrupt
                                                                                    Source Select.  #br# #br#OSINT3 can
                                                                                    be used to trigger an ADC interrupt
                                                                                    (ADCINT1 through ADCINT4) via
                                                                                    selection in the ADCINT1N2 or
                                                                                    ADCINT3N4.  This selection determines
                                                                                    if a sync. event can trigger OSINT3
                                                                                    in addition to a PCOUNT = LIMIT
                                                                                    event.     #br#   #br#0 = OSINT3 will
                                                                                    be generated from PCOUNT = LIMIT only
                                                                                    #br#1 = OSTIN3 will be generated form
                                                                                    PCOUNT = LIMIT or a sync. event.
                                                                                    #br# #br#Note: If a SYNC event would
                                                                                    cause an OSINT one cycle after OSINT
                                                                                    would have been cause by PCOUNT =
                                                                                    LIMIT match, then the second OSINT is
                                                                                    ignored. */
/* HSADC1_ADCPPB3CONFIG2_1[COMPSEL] Bits */
#define HSADC1_ADCPPB3CONFIG2_1_COMPSEL_OFS      (15)                            /* !< COMPSEL Offset */
#define HSADC1_ADCPPB3CONFIG2_1_COMPSEL_MASK     ((uint32_t)0x00008000U)         /* !< Post Processing Block 3 Compare
                                                                                    Source Select.  This field determines
                                                                                    whether ADCPPB3RESULT or ADCPPB3SUM
                                                                                    is used for the threshold compare.
                                                                                    #br# #br#0 = ADCPPB3RESULT is used
                                                                                    for compare logic #br#1 = ADCPPB3SUM
                                                                                    is used for compare logic */

