TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_ADCPPB3PSUM_LITE_ Bits */
/* HSADC1_ADCPPB3PSUM_LITE_[PSUM] Bits */
#define HSADC1_ADCPPB3PSUM_LITE__PSUM_OFS        (0)                             /* !< PSUM Offset */
#define HSADC1_ADCPPB3PSUM_LITE__PSUM_MASK       ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB3RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB3
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB3RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC1_ADCPPB3PSUM_LITE_[SIGN] Bits */
#define HSADC1_ADCPPB3PSUM_LITE__SIGN_OFS        (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3PSUM_LITE__SIGN_MASK       ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB3PSUM_1 Bits */
/* HSADC1_ADCPPB3PSUM_1[PSUM] Bits */
#define HSADC1_ADCPPB3PSUM_1_PSUM_OFS            (0)                             /* !< PSUM Offset */
#define HSADC1_ADCPPB3PSUM_1_PSUM_MASK           ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB3RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB3
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB3RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC1_ADCPPB3PSUM_1[SIGN] Bits */
#define HSADC1_ADCPPB3PSUM_1_SIGN_OFS            (16)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3PSUM_1_SIGN_MASK           ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC1_ADCPPB3PMAX Bits */
/* HSADC1_ADCPPB3PMAX[PMAX] Bits */
#define HSADC1_ADCPPB3PMAX_PMAX_OFS              (0)                             /* !< PMAX Offset */
#define HSADC1_ADCPPB3PMAX_PMAX_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Max.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB3RESULT the result replaces
                                                                                    this register if it is larger.   #br#
                                                                                    #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB3 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */
/* HSADC1_ADCPPB3PMAX[SIGN] Bits */
#define HSADC1_ADCPPB3PMAX_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3PMAX_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB3PMIN Bits */
/* HSADC1_ADCPPB3PMIN[PMIN] Bits */
#define HSADC1_ADCPPB3PMIN_PMIN_OFS              (0)                             /* !< PMIN Offset */
#define HSADC1_ADCPPB3PMIN_PMIN_MASK             ((uint32_t)0x0001FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Partial Min.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB3RESULT the result replaces
                                                                                    this register if it is smaller.
                                                                                    #br# #br#This register is reset when
                                                                                    either a count-match event occurs
                                                                                    (PCOUNT = LIMIT) or PPB3 receives a
                                                                                    sync. event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */
/* HSADC1_ADCPPB3PMIN[SIGN] Bits */
#define HSADC1_ADCPPB3PMIN_SIGN_OFS              (17)                            /* !< SIGN Offset */
#define HSADC1_ADCPPB3PMIN_SIGN_MASK             ((uint32_t)0xFFFE0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 16. */

/* HSADC1_ADCPPB3TRIPLO2 Bits */
/* HSADC1_ADCPPB3TRIPLO2[LIMITLO] Bits */
#define HSADC1_ADCPPB3TRIPLO2_LIMITLO_OFS        (0)                             /* !< LIMITLO Offset */
#define HSADC1_ADCPPB3TRIPLO2_LIMITLO_MASK       ((uint32_t)0x00FFFFFFU)         /* !< ADC Post Processing Block 3 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB3TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO2[23:17] will be ignored in 16
                                                                                    bit mode #br#- TRIPLO2[23:13] will be
                                                                                    ignored in 12 bit mode */

/* HSADC1_ADCPPB4LIMIT_LITE_ Bits */
/* HSADC1_ADCPPB4LIMIT_LITE_[LIMIT] Bits */
#define HSADC1_ADCPPB4LIMIT_LITE__LIMIT_OFS      (0)                             /* !< LIMIT Offset */
#define HSADC1_ADCPPB4LIMIT_LITE__LIMIT_MASK     ((uint32_t)0x00000003U)         /* !< Post Processing Block 4
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC1_ADCPPB4LIMIT_1 Bits */
/* HSADC1_ADCPPB4LIMIT_1[LIMIT] Bits */
#define HSADC1_ADCPPB4LIMIT_1_LIMIT_OFS          (0)                             /* !< LIMIT Offset */
#define HSADC1_ADCPPB4LIMIT_1_LIMIT_MASK         ((uint32_t)0x00000003U)         /* !< Post Processing Block 4
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC1_ADCPPB4PCOUNT_LITE_ Bits */
/* HSADC1_ADCPPB4PCOUNT_LITE_[PCOUNT] Bits */
#define HSADC1_ADCPPB4PCOUNT_LITE__PCOUNT_OFS    (0)                             /* !< PCOUNT Offset */
#define HSADC1_ADCPPB4PCOUNT_LITE__PCOUNT_MASK   ((uint32_t)0x00000007U)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB4PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */

/* HSADC1_ADCPPB4PCOUNT_1 Bits */
/* HSADC1_ADCPPB4PCOUNT_1[PCOUNT] Bits */
#define HSADC1_ADCPPB4PCOUNT_1_PCOUNT_OFS        (0)                             /* !< PCOUNT Offset */
#define HSADC1_ADCPPB4PCOUNT_1_PCOUNT_MASK       ((uint32_t)0x00000007U)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB4PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */

