TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_hsadc1.h
/* HSADC1_DTB_1 Bits */
/* HSADC1_DTB_1[DTB_OUT] Bits */
#define HSADC1_DTB_1_DTB_OUT_OFS                 (0)                             /* !< DTB_OUT Offset */
#define HSADC1_DTB_1_DTB_OUT_MASK                ((uint32_t)0x0000FFFFU)         /* !< Digital Test Bus from HSADC12b */

/* HSADC1_ADCSEQCTL Bits */
/* HSADC1_ADCSEQCTL[SEQEND] Bits */
#define HSADC1_ADCSEQCTL_SEQEND_OFS              (0)                             /* !< SEQEND Offset */
#define HSADC1_ADCSEQCTL_SEQEND_MASK             ((uint32_t)0x0000000FU)         /* !< END SOC of last enabled sequence */
/* HSADC1_ADCSEQCTL[SEQPREEMPT] Bits */
#define HSADC1_ADCSEQCTL_SEQPREEMPT_OFS          (16)                            /* !< SEQPREEMPT Offset */
#define HSADC1_ADCSEQCTL_SEQPREEMPT_MASK         ((uint32_t)0x00030000U)         /* !< SoC Sequence PREEMPT #br#0X:
                                                                                    Pre-empt disabled #br#10: Pre-empt
                                                                                    enabled and will not restart aborted
                                                                                    Sequence #br#11: Pre-empt enabled and
                                                                                    will restart aborted Sequence */

/* HSADC1_ADCSEQCTL_1 Bits */
/* HSADC1_ADCSEQCTL_1[SEQEND] Bits */
#define HSADC1_ADCSEQCTL_1_SEQEND_OFS            (0)                             /* !< SEQEND Offset */
#define HSADC1_ADCSEQCTL_1_SEQEND_MASK           ((uint32_t)0x0000000FU)         /* !< END SOC of last enabled sequence */
/* HSADC1_ADCSEQCTL_1[SEQPREEMPT] Bits */
#define HSADC1_ADCSEQCTL_1_SEQPREEMPT_OFS        (16)                            /* !< SEQPREEMPT Offset */
#define HSADC1_ADCSEQCTL_1_SEQPREEMPT_MASK       ((uint32_t)0x00030000U)         /* !< SoC Sequence PREEMPT #br#0X:
                                                                                    Pre-empt disabled #br#10: Pre-empt
                                                                                    enabled and will not restart aborted
                                                                                    Sequence #br#11: Pre-empt enabled and
                                                                                    will restart aborted Sequence */

/* HSADC1_ADCSEQ1CONFIG Bits */
/* HSADC1_ADCSEQ1CONFIG[ACQPS] Bits */
#define HSADC1_ADCSEQ1CONFIG_ACQPS_OFS           (0)                             /* !< ACQPS Offset */
#define HSADC1_ADCSEQ1CONFIG_ACQPS_MASK          ((uint32_t)0x000000FFU)         /* !< SOC1 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC1_ADCSEQ1CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC1_ADCSEQ1CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC1_ADCSEQ1CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC1 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC1_ADCSEQ1CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC1_ADCSEQ1CONFIG_SAMPCAPRESETSEL_OFS (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC1_ADCSEQ1CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC1 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC1_ADCSEQ1CONFIG[SEQSTART] Bits */
#define HSADC1_ADCSEQ1CONFIG_SEQSTART_OFS        (15)                            /* !< SEQSTART Offset */
#define HSADC1_ADCSEQ1CONFIG_SEQSTART_MASK       ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ1 */
/* HSADC1_ADCSEQ1CONFIG[TRIGSEL] Bits */
#define HSADC1_ADCSEQ1CONFIG_TRIGSEL_OFS         (20)                            /* !< TRIGSEL Offset */
#define HSADC1_ADCSEQ1CONFIG_TRIGSEL_MASK        ((uint32_t)0x00700000U)         /* !< SOC1 Trigger Source Select. Along
                                                                                    with the SOC1 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC1 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC1_ADCSEQ1CONFIG[SEQSWFRC] Bits */
#define HSADC1_ADCSEQ1CONFIG_SEQSWFRC_OFS        (30)                            /* !< SEQSWFRC Offset */
#define HSADC1_ADCSEQ1CONFIG_SEQSWFRC_MASK       ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 1 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC1_ADCSEQ1CONFIG[SEQENABLE] Bits */
#define HSADC1_ADCSEQ1CONFIG_SEQENABLE_OFS       (31)                            /* !< SEQENABLE Offset */
#define HSADC1_ADCSEQ1CONFIG_SEQENABLE_MASK      ((uint32_t)0x80000000U)         /* !< SEQ1Enable #br#Indicates whether
                                                                                    the Sequence1 is enabled or not */

/* HSADC1_ADCSEQ2CONFIG Bits */
/* HSADC1_ADCSEQ2CONFIG[ACQPS] Bits */
#define HSADC1_ADCSEQ2CONFIG_ACQPS_OFS           (0)                             /* !< ACQPS Offset */
#define HSADC1_ADCSEQ2CONFIG_ACQPS_MASK          ((uint32_t)0x000000FFU)         /* !< SOC2 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC1_ADCSEQ2CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC1_ADCSEQ2CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC1_ADCSEQ2CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC2 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC1_ADCSEQ2CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC1_ADCSEQ2CONFIG_SAMPCAPRESETSEL_OFS (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC1_ADCSEQ2CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC2 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC1_ADCSEQ2CONFIG[SEQSTART] Bits */
#define HSADC1_ADCSEQ2CONFIG_SEQSTART_OFS        (15)                            /* !< SEQSTART Offset */
#define HSADC1_ADCSEQ2CONFIG_SEQSTART_MASK       ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ2 */
/* HSADC1_ADCSEQ2CONFIG[TRIGSEL] Bits */
#define HSADC1_ADCSEQ2CONFIG_TRIGSEL_OFS         (20)                            /* !< TRIGSEL Offset */
#define HSADC1_ADCSEQ2CONFIG_TRIGSEL_MASK        ((uint32_t)0x00700000U)         /* !< SOC2 Trigger Source Select. Along
                                                                                    with the SOC2 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC2 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC1_ADCSEQ2CONFIG[SEQSWFRC] Bits */
#define HSADC1_ADCSEQ2CONFIG_SEQSWFRC_OFS        (30)                            /* !< SEQSWFRC Offset */
#define HSADC1_ADCSEQ2CONFIG_SEQSWFRC_MASK       ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 2 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC1_ADCSEQ2CONFIG[SEQENABLE] Bits */
#define HSADC1_ADCSEQ2CONFIG_SEQENABLE_OFS       (31)                            /* !< SEQENABLE Offset */
#define HSADC1_ADCSEQ2CONFIG_SEQENABLE_MASK      ((uint32_t)0x80000000U)         /* !< SEQ2Enable #br#Indicates whether
                                                                                    the Sequence2 is enabled or not */

/* HSADC1_ADCSEQ3CONFIG Bits */
/* HSADC1_ADCSEQ3CONFIG[ACQPS] Bits */
#define HSADC1_ADCSEQ3CONFIG_ACQPS_OFS           (0)                             /* !< ACQPS Offset */
#define HSADC1_ADCSEQ3CONFIG_ACQPS_MASK          ((uint32_t)0x000000FFU)         /* !< SOC3 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC1_ADCSEQ3CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC1_ADCSEQ3CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC1_ADCSEQ3CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC3 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC1_ADCSEQ3CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC1_ADCSEQ3CONFIG_SAMPCAPRESETSEL_OFS (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC1_ADCSEQ3CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC3 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC1_ADCSEQ3CONFIG[SEQSTART] Bits */
#define HSADC1_ADCSEQ3CONFIG_SEQSTART_OFS        (15)                            /* !< SEQSTART Offset */
#define HSADC1_ADCSEQ3CONFIG_SEQSTART_MASK       ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ3 */
/* HSADC1_ADCSEQ3CONFIG[TRIGSEL] Bits */
#define HSADC1_ADCSEQ3CONFIG_TRIGSEL_OFS         (20)                            /* !< TRIGSEL Offset */
#define HSADC1_ADCSEQ3CONFIG_TRIGSEL_MASK        ((uint32_t)0x00700000U)         /* !< SOC3 Trigger Source Select. Along
                                                                                    with the SOC3 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC3 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC1_ADCSEQ3CONFIG[SEQSWFRC] Bits */
#define HSADC1_ADCSEQ3CONFIG_SEQSWFRC_OFS        (30)                            /* !< SEQSWFRC Offset */
#define HSADC1_ADCSEQ3CONFIG_SEQSWFRC_MASK       ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 3 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC1_ADCSEQ3CONFIG[SEQENABLE] Bits */
#define HSADC1_ADCSEQ3CONFIG_SEQENABLE_OFS       (31)                            /* !< SEQENABLE Offset */
#define HSADC1_ADCSEQ3CONFIG_SEQENABLE_MASK      ((uint32_t)0x80000000U)         /* !< SEQ3Enable #br#Indicates whether
                                                                                    the Sequence3 is enabled or not */

